{
  "id": "Fitstwritingpost202508021157",
  "title": "Fitst writing post",
  "subheading": "no  heading",
  "category": "poems",
  "coverImage": "http://localhost:5000/uploads/Group_47-1754135821607.png",
  "content": [
    {
      "type": "paragraph",
      "text": "no  heading"
    },
    {
      "type": "paragraph",
      "text": ""
    },
    {
      "type": "paragraph",
      "text": "Wikipedia The Free Encyclopedia"
    },
    {
      "type": "paragraph",
      "text": "    Donate\n    Create account\n    Log in"
    },
    {
      "type": "paragraph",
      "text": "Contents\n(Top)\nBackground"
    },
    {
      "type": "paragraph",
      "text": "By continent"
    },
    {
      "type": "paragraph",
      "text": "    See also\n    References\n    External links"
    },
    {
      "type": "paragraph",
      "text": "Poet laureate"
    },
    {
      "type": "paragraph",
      "text": "    Article\n    Talk"
    },
    {
      "type": "paragraph",
      "text": "    Read\n    Edit\n    View history"
    },
    {
      "type": "paragraph",
      "text": "Tools"
    },
    {
      "type": "paragraph",
      "text": "Appearance\nText"
    },
    {
      "type": "paragraph",
      "text": "    Small\n    Standard\n    Large"
    },
    {
      "type": "paragraph",
      "text": "Width"
    },
    {
      "type": "paragraph",
      "text": "    Standard\n    Wide"
    },
    {
      "type": "paragraph",
      "text": "Color (beta)"
    },
    {
      "type": "paragraph",
      "text": "    Automatic\n    Light\n    Dark"
    },
    {
      "type": "paragraph",
      "text": "From Wikipedia, the free encyclopedia\nA depiction of Torquato Tasso from a German encyclopedia, 1905. Note the laurel crown."
    },
    {
      "type": "paragraph",
      "text": "A poet laureate (plural: poets laureate)[1][2][3] is a poet officially appointed by a government or conferring institution, typically expected to compose poems for special events and occasions. Albertino Mussato of Padua and Francesco Petrarca (Petrarch) of Arezzo were the first to be crowned poets laureate after the classical age, respectively in 1315 and 1342.[4] In Britain, the term dates from the appointment of Bernard André by Henry VII of England. The royal office of Poet Laureate in England dates from the appointment of John Dryden in 1668."
    },
    {
      "type": "paragraph",
      "text": "In modern times a poet laureate title may be conferred by an organization such as the Poetry Foundation, which designates a Young People's Poet Laureate, unconnected with the National Youth Poet Laureate and the United States Poet Laureate.[5]"
    },
    {
      "type": "paragraph",
      "text": "The office is also popular with regional and community groups. Examples include the Pikes Peak Poet Laureate,[6] which is designated by a \"Presenting Partners\" group from within the community, the Minnesota poet laureate chosen by the League of Minnesota Poets (est. 1934),[7] the Northampton Poet Laureate[8] chosen by the Northampton Arts Council,[9] and the Martha's Vineyard Poet Laureate chosen by ten judges representing the Martha's Vineyard Poetry Society.\nBackground"
    },
    {
      "type": "paragraph",
      "text": "In ancient Greece, the laurel was used to form a crown or wreath of honour for poets and heroes. The custom derives from the ancient myth of Daphne and Apollo (Daphne signifying \"laurel\" in Greek), and was revived in Padua for Albertino Mussato,[10] followed by Petrarch's own crowning ceremony in the audience hall of the medieval senatorial palazzo on the Campidoglio on April 8, 1341.[11][12] Because the Renaissance figures who were attempting to revive the Classical tradition lacked detailed knowledge of the Roman precedent they were attempting to emulate, these ceremonies took on the character of doctoral candidatures.[13] In Persia, the poet laureate (amīr- or malek-al-šoʿarāʾ) carried artistic authority and were provided sources of income.[14]"
    },
    {
      "type": "paragraph",
      "text": "Since the office of poet laureate has become widely adopted, the term \"laureate\" has come to signify recognition for preeminence or superlative achievement (cf. Nobel laureate). A royal degree in rhetoric, poet laureate was awarded at European universities in the Middle Ages. The term therefore may refer to the holder of such a degree, which recognized skill in rhetoric, grammar, and language. During England's seventeenth century, the poet laureate served as the \"court poet\" of royalty, and was often called upon to celebrate state occasions until that role was abolished during the early 1800s.[15] The skald in ancient Scandinavia often spent their careers too serving as the court poets of Norway's kings.[16] Just like the first English poets laureate, ministers during China's feudal era presented \"commanded poems\" at royal events and were beholden to the ruling class.[17] In Japan, the poet laureate (keikanshijin) was also imperially appointed and were often called upon to read at the annual Utakai Hajime.[18][19][20][21] Comparatively, in Africa, kingdoms such as the Kuba in the Belgian Congo (modern day Democratic Republic of the Congo) appointed bards that served as both the royal historian and poet laureate.[22] In addition to being known as poets laureate, bards were also referred to as \"praise-poets\" due to their special function of venerating the chief.[23]"
    },
    {
      "type": "paragraph",
      "text": "In the Xhosa language, Imbongi YeSizwethe can be translated to mean either \"poet laureate\" or \"national poet\".[24][25] Similar to what is expressed in the Xhosa term, some poets have been dually noted as \"poet laureate\" and \"national poet\" depending upon the source: Agostinho Neto (Angola),[26] Kazi Nazrul Islam (Bangladesh),[27] Rabindranath Tagore (India),[28] José Craveirinha (Mozambique),[29] Mahmoud Darwish (Palestine),[30][31] Mohamed Ibrahim Warsame 'Hadrawi' (Somalia),[32] Edwin Thumboo (Singapore)[33] and Taras Shevchenko (Ukraine).[34] This contrasts with other figures such as Shamsur Rahman (Bangladesh),[35] Thomas Moore (Bermuda),[36] Leung Ping-kwan (Hong Kong),[37] Francisco Borja da Costa (Timor–Leste)[38] and Haji Gora Haji (Zanzibar)[39]—who are conferred an \"unofficial poet laureate\" status due to their poetical works."
    },
    {
      "type": "paragraph",
      "text": "As of modern times, over a dozen national governments continue the poet laureate tradition. The Commonwealth of Nations even has its own position, and Selina Tusitala Marsh was appointed the inaugural Commonwealth Poet Laureate in 2025.[40]\nBy continent\nAfricaAlgeria"
    },
    {
      "type": "paragraph",
      "text": "In Algeria, during the 11th century, Ibn Sharaf al-Qayrawani was the court poet of the Zīrids. Al-Thaghri Al-Tilimsani was appointed as a court poet during the Zayyanid dynasty.[41]\nBurkina Faso"
    },
    {
      "type": "paragraph",
      "text": "Boûbacar Tinguidji, a Fula maabo, was appointed as the court poet of the Ruler of Dori.[42]\nCameroon"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Cameroon include René Philombé.[43]\nCape Verde"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Cape Verde include Eugénio Tavares.[44]\nEgypt"
    },
    {
      "type": "paragraph",
      "text": "Ahmed Shawqi became Egypt's Poet Laureate in 1894.[45]\nEritrea"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Eritrea include Reesom Haile.[46]\nEthiopia\nTsegaye Gabre-Medhin of Ethiopia"
    },
    {
      "type": "paragraph",
      "text": "In Ethiopia, the officially designated Laureate includes Tsegaye Gebre-Medhin. Tsegaye's award was granted in 1966 by His Majesty, Haile-Selasie II.[47]\nGambia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of The Gambia include Lenrie Peters.[48]\nGhana"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Ghana include Atukwei Okai.[49][50]\nKenya"
    },
    {
      "type": "paragraph",
      "text": "Muyaka bin Haji al-Ghassaniy was the Poet Laureate of Mombasa, Kenya.[51]\nLesotho"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Lesotho include Joshua Pulumo Mohapeloa.[52]\nLiberia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate for the Republic of Liberia have included Roland T. Dempster, Melvin B. Tolson (1947), and Patricia Jabbeh Wesley.[53][54][55]\nLibya"
    },
    {
      "type": "paragraph",
      "text": "Libya-born Callimachus was appointed as an imperial court poet to Ptolemy II Philadelphus.[56]\nMadagascar"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Madagascar include Jacques Rabemananjara.[57]\nMalawi"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Malawi include Jack Mapanje.[58]\nMali"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Mali include Ban Sumana Sisòkò.[59][60]\nMauritania"
    },
    {
      "type": "paragraph",
      "text": "Mohamed Ould Taleb was appointed as the official court poet during Mohamed Ould Abdel Aziz's presidency in Mauritania.[61]\nMauritius"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Mauritius include Édouard Maunick.[62]\nMorocco"
    },
    {
      "type": "paragraph",
      "text": "In the 13th century, Abdelaziz al-Malzuzi was the court poet of Abu Yahya ibn Abd al-Haqq. During the 16th-17th centuries in Morocco's history, Abd al-Aziz al-Fishtali was appointed as the poet laureate of the Sultan Ahmad al-Mansur.[63]\nNiger"
    },
    {
      "type": "paragraph",
      "text": "Burkina Faso-born Boûbacar Tinguidji, a Fula maabo, was appointed as the court poet of the Songhai chief Mossi Gaidou in Dargol, Niger.[42]\nNigeria"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Nigeria include Obo Aba Hisanjani and Niyi Osundare.[64][65] Mamman Jiya Vatsa was the inaugural poet laureate of Abuja, Nigeria.[66] Tanure Ojaide was the Poet Laureate of the Niger Delta.[67]\nRwanda"
    },
    {
      "type": "paragraph",
      "text": "During the 18th century in Rwanda's history, Semidogoro was the official court poet of Mibambwe III Mutabazi II Sentabyo.[68] Sekarama was the official court poet during the reigns of Kigeli IV Rwabugiri and Mutara III Rudahigwa.[69] Poets laureate of Rwanda include Edouard Bamporiki Uwayo.[70]\nSenegal"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Senegal include Léopold Sédar Senghor and Robert Hayden (1966).[71][72]\nSierra Leone"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Sierra Leone include the Italian authors Roberto Malini and Dario Picciau.[73]\nSouth Africa"
    },
    {
      "type": "paragraph",
      "text": "In the 19th century, Magolwane kaMkhathini Jiyane was the court poet of Shaka Zulu.[74][75] During the 20th century, David Livingstone Phakamile (Yali-Manisi) was the poet laureate of Kaiser Matanzima.[76] Poets laureate of South Africa include Mazisi Kunene (2005), Keorapetse Kgositsile (2006), and Mongane Wally Serote (2018– ).[77][78][79]\nSudan"
    },
    {
      "type": "paragraph",
      "text": "During the 1800s in Sudan, Al U'aysir was the court poet (inqīb) of the Ja'alin tribe King Mek Nimr.[80]\nTanzania"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Tanzania include Saadani Kandoro (1969).[81][82]\nTunisia"
    },
    {
      "type": "paragraph",
      "text": "During the 10th century, Muhammad ibn Hani al-Andalusi al-Azdi was appointed as the chief court poet to the Fatimid Caliph al-Mu'izz.[83] Also, in the 10th century, Ali ibn Muhammad al-Iyadi was the court poet of Fatimid caliphs al-Qa'im, al-Mansur, and al-Mu'izz. Poets laureate of Tunisia include Qasim Shabi.[84]\nUganda"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Uganda include Akena Adoko.[85]\nZimbabwe"
    },
    {
      "type": "paragraph",
      "text": "Ginyilitshe Hlabangana was the official poet laureate (or Imbongi YeNkosi) for the Ndebele Kingdom (now called Matabeleland, Zimbabwe).[86]\nAsia\nAfghanistan"
    },
    {
      "type": "paragraph",
      "text": "During the 10–11th century, Unsuri was made poet laureate by Sultan Maḥmūd of Ghazna.[87] Modern poets laureate of Afghanistan include Abdullah \"Malik al-Shu'Ara\" Qari, Sufi Abdul Bitab, and Ustad Khalilullah Khalili.[88][89]\nArmenia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Armenia include Avetik Isahakian and Hovhannes Toumanian (1970).[90][91]\nAzerbaijan"
    },
    {
      "type": "paragraph",
      "text": "In 1502, Azerbaijan-born court poet Habibi earned the title \"king of poets\" from Safavid king Ismail I. Poets laureate of Azerbaijan include Bakhtiyar Vahabzadeh.[92][93]\nBahrain"
    },
    {
      "type": "paragraph",
      "text": "Bahrain-born Muḥammad Sharīf al-Shībānī served as the poet laureate of the court of Abu Dhabi, United Arab Emirates (c. 1967).[94]\nBangladesh"
    },
    {
      "type": "paragraph",
      "text": "During the 15th century, Zainuddin was appointed the court poet of Bengal while under the patronage of Prince Yusuf Khan.[95][96] Yusuf-Zulekha was the court poet of Sultan of Bengal, Ghiyasuddin Azam Shah. Sometime during the 15th-16th century, Shah Muhammad Saghir was the poet laureate of the Sultan of Bengal Ghiyasuddin Azam Shah.[97] Daulat Qazi, born in what is now modern day Bangladesh, was officially appointed as the poet for the Arakan court in Myanmar (then ruled by King Thiri Thudhamma).[98]\nBrunei"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Brunei include royal poet Omar Ali Saifuddien III.[99][100]\nCambodia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Cambodia include Ind (1907–1924).[101][102]\nChina"
    },
    {
      "type": "paragraph",
      "text": "In Ancient China, Emperor Yuan of Han appointed Shi You as the poet laureate.[103] During the Tang dynasty, He Zhichang was appointed as the poet laureate of Emperor Ho Kwei.[104] Zhou Boqi was a court poet appointed during the Yuan Dynasty.\nCyprus"
    },
    {
      "type": "paragraph",
      "text": "During the 19th century, after the Turks invaded Cyprus, Mufti Hilmi Efendi was appointed the poet laureate of Sultan Mahmud II.[105] In 1980, the World Academy of Arts and Culture awarded Cyprus-born Costas Montis the title of Poet Laureate.[106]\nGeorgia"
    },
    {
      "type": "paragraph",
      "text": "Heraclius II of Georgia appointed Sayat-Nova as his poet laureate at the court of Tbilisi.[107]\nIndia"
    },
    {
      "type": "paragraph",
      "text": "In India, poets laureate were maintained at the royal courts beginning in ancient times.[108] For instance, in Ancient India, Harisena was designated poet laureate by Emperor Samudragupta.[109] During the 7th century, Emperor Harsha proclaimed Bāṇabhaṭṭa as the poet laureate.[110] Jayamkondar was made poet laureate by Chola Emperor Kulottunga I.[111] In the 10th century, Ranna was the poet laureate of Western Chalukya Kings Tailapa II and Satyashraya.[112][113] Adikavi Pampa was the court poet of Vemulavada Chalukya king Arikesari II. Also, in the 10th century, Ponna received the title Kavichakravarthi (poet laureate) and Ubhaya-Chakravarthi (imperial poet in two languages) from Rashtrakuta king Krishna III. Padmagupta Parimala was a Paramama court poet.[114] In the mid-11th century, Nannaya was the poet-laureate of Rajaraja Narendra."
    },
    {
      "type": "paragraph",
      "text": "In the 15th century, Cherusseri Namboothiri was the court poet of Udaya Varma. During the 15th-16th centuries, Allasani Peddana was the poet laureate of Emperor Krishnadevaraya of Vijayanagara. In the 16th century, Shaikh Gadai Kamboh was the poet laureate in the court of Sultan of Sikandar Lodhi. In 1665, Nusrati was made a poet laureate by Sultan ʿAlī II (r. 1656–1672) of the ʿĀdil-Shāhī dynasty.[115] During the Mughal Empire, Emperor Akbar made Birbal the poet laureate.[116] In the aforementioned empire's later history, Taleb Amoli was Emperor Jahangir's poet laureate from 1618 to 1627,[117] and Emperor Shah Jahan appointed Jagannatha Panditaraja as the poet laureate during his reign.[118] In the 18th century, Bharatchandra Ray was the court poet of Maharaja Krishnachandra."
    },
    {
      "type": "paragraph",
      "text": "Mohammad Ibrahim Zauq was the poet laureate of the final Mughal Emperor Bahadur Shah Zafar.[119] In the 19th century, Ghalib was appointed as the poet laureate of the Mughal Court.[120] In the 1890s, Z. Savarayalounaiker was regarded as the Poet Laureate of French India (particularly Pondicherry).[121][122]"
    },
    {
      "type": "paragraph",
      "text": "In the Indian subcontinent Kashmir, Mullah Nadiri was the poet laureate during the reign of Sultan Sikandar (1378–1416, reigned 1389–1413).\nAndhra Pradesh"
    },
    {
      "type": "paragraph",
      "text": "Sripada Krishnamurty Sastry was the first poet laureate of Andhra Pradesh, India.[123] Dasarathi served as the court poet (aasthana kavi) for the government of Andhra Pradesh.\nJaisalmer"
    },
    {
      "type": "paragraph",
      "text": "Alseedan ji Ratnu was the poet laureate (raj-kavi) of Jaisalmer state.\nKarnataka"
    },
    {
      "type": "paragraph",
      "text": "In what was once the Western Chalukya Empire, Nagavarma II was the poet laureate (Katakacharya) by Chalukya King Jagadhekamalla.[124][125][126]\nKerala"
    },
    {
      "type": "paragraph",
      "text": "K. C. Kesava Pillai was the Poet Laureate of Travancore (located in present-day Kerala state). Vallathol Narayana Menon was the Poet Laureate of Kerala.[127][128]\nMadhya Pradesh"
    },
    {
      "type": "paragraph",
      "text": "During the 15th century, Raidhu (who was born in Gwalior) was the poet laureate for the court of Dungar Singh and Kirti Singh.\nMaharashtra"
    },
    {
      "type": "paragraph",
      "text": "Bhaskar Ramchandra Tambe was the poet laureate of Maharashtra.[129]\nTamil Nadu"
    },
    {
      "type": "paragraph",
      "text": "Kannadasan was the poet laureate of Tamil Nadu at the time of his death.\nTelegana"
    },
    {
      "type": "paragraph",
      "text": "Sripada Krishna Sastry was the poet laureate during the 20th century.[130]\nIndonesia"
    },
    {
      "type": "paragraph",
      "text": "In the 14th century, Mpu Prapanca served as the poet laureate in the royal court of Emperor Hayam Wuruk.[131][132][133] During the 18th century, Yasadipura I served as the Poet Laureate of Surakarta Sunanate.[134]\nIran\nMohammad-Taqi Bahar poet laureate of Mozaffar ad-Din Shah Qajar."
    },
    {
      "type": "paragraph",
      "text": "In the 11th century, Iran-born Abu-al-Faraj Runi became a court poet during the Ghaznavid period. Manuchehri was another court poet during the aforementioned period. Qatran Tabrizi was the court poet of the dynasties of the Rawadids and Shaddadids. During the 13th century, Khwaju Kermani was the official court poet of Il-Khanid rulers Abu Sa'id Bahadur Khan and Arpa Ke'un, the Mozaffarid Mubariz al-Din Muhammad, and Abu Ishaq Inju of the Inju dynasty.[135] Farid Isfarayini was the court poet of the Salghurids in Shiraz.[136] In the 14th century, Salman Savaji was the court poet of the Jalayirids.[137]"
    },
    {
      "type": "paragraph",
      "text": "During the Safavid era, Vahshi Bafqi was the poet laureate of Ghiyat al-Din Mir Miran.[138] Sometime during the 15th century, Baba Fighani Shirazi became the court poet of Aq Qoyunlu Ya'qub Beg. In the 17th century, Taleb Amoli was made the poet laureate of the Mughal emperor Jahangir (1618). Also, in the 17th century, during his travels to India, the Persian poet Kalim Kashani was made poet laureate by Mogul emperor Shah Jahan in 1632.[139] During the 18th century, Saba (Fath-Ali Khan Kashani) was the poet laureate of Fath-Ali Shah Qajar.[140] In the 19th century, Prince Gholam-Hossein Mirza was the poet laureate of Mozaffar al-Din Mirza in Tabriz."
    },
    {
      "type": "paragraph",
      "text": "Mohammad-Taqi Bahar was the poet laureate of Mozaffar ad-Din Shah Qajar. He was born in Mashhad in 1884 (died 1951) and was a conservative figure among the modernists. He was appointed Poet Laureate by royal decree in 1903.[141]\nIraq"
    },
    {
      "type": "paragraph",
      "text": "In Iraq's ancient history, Ibn 'Atiyah Jarir was the court poet of Ibn Yusuf al-Hajjaj during the Umayyad period.[142] Abd al-Malik Burhani was the poet laureate of Sanjar under Malik Shāh I and Sultān Sanjar.[143] Regarding cities, Aban al-Lahiqi was the court poet of the Barmakids in Baghdad. Poets laureate of Iraq include Muhammed Mahdi al-Jawahiri.[144]\nIsrael"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Israel include Avigdor Hameiri and Haim Gouri.[145][146]\nJapan"
    },
    {
      "type": "paragraph",
      "text": "Kakinomoto no Hitomaro serve as the court poet of Empress Jitō. During the Heien period, Ariwara no Yukihira, Murasaki Shikibu, Fujiwara no Kintō and Akazome Emon were court poets.[147] Poets laureate of Japan include Baron Takasaki Masamitsu. The current Princess of Benin, Damarea Liao was named Japan's first 'National Youth Poet Laureate' in 2024. [1]\nJordan"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Jordan include Haider Mahmoud.[148][149]\nKazakhstan"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Kazakhstan include Abdilda Tazhibaev.[150][151]\nKorea"
    },
    {
      "type": "paragraph",
      "text": "During the 12th century, Jeong Ji-sang was appointed as a court poet of King Injong of Goryeo.[152] During the reign of Jungjong of Joseon in the 16th century, Yun Kyung was appointed as the court poet to the king.[153]"
    },
    {
      "type": "paragraph",
      "text": "Beginning around 1994, North Korea had 6 active poets laureate who worked in the epic genre.[154] Epic poetry was the chief vehicle of political propaganda during the rule of Kim Jong-il, and the poets worked according to the requests and needs of Kim Jong-il.[154] Some of the poets are Jang Jin-sung (pseudonym), Kim Man-young and Shin Byung-gang.[154]\nKuwait"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Kuwait include Mulla Abdeen.[155]\nKyrgyzstan"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Kyrgyzstan include Chinghiz Aitmatov.[156]\nLaos"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Laos include Nhouy Abhay.[157]\nLebanon"
    },
    {
      "type": "paragraph",
      "text": "During the Shihab dynasty in Lebanon, Nicola al-Turk was officially appointed as a court poet of Bashir Shihab II.[158]\nMalaysia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Malaysia include Muhammad Haji Salleh and Datuk Zurinah Hassan (upon her becoming a Malaysian National Laureate in 2015).[159][160] In the 20th century, Raja Haji Yahya was designed by the High Commissioner of the Malay States as the Poet Laureate of Perak.[161]\nMaldives"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of the Maldives include Sheikh Mohamed Jamaluddin (c. 1890), who also served as a judge.[162]\nMongolia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Mongolia include Ke Ming.[163] Saichungga was the Poet Laureate of Inner Mongolia.[164]\nMyanmar"
    },
    {
      "type": "paragraph",
      "text": "In ancient Burma, there were kings who bestowed the title of nawade to the poets laureate. However, according to Kaung (2011), two nawades are often discussed in Burmese literature: Nawadegyi (1498–1588; Prome Nawade) and Dutiya (1756–1840; Wetmasut Nawade).[165][166][167]"
    },
    {
      "type": "paragraph",
      "text": "Other historical figures include U Shun, who was appointed as a court poet to King Bagyidaw during the Konbaung dynasty of Burma.[168] During the Konbaung dynasty, Letwe Thondara served as the court poet of Mahadhammaraza Dipadi.[169][170] Later, in the country's history, Soe Nyunt was appointed as the Poet Laureate of Burma.[171]\nNepal"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Nepal include Lekhnath Paudyal and Laxmi Prasad Devkota.[172][173][174]\nOman"
    },
    {
      "type": "paragraph",
      "text": "In Oman, Al-Sitali served as the poet laureate during the Nabhani dynasty.[175]\nPakistan"
    },
    {
      "type": "paragraph",
      "text": "During the 18th century, Jam Durrak was appointed as the poet laureate of the royal court of Mir Nasir Khan I.[176] Later in Pakistan's history, Poets laureate of Pakistan would include Hafeez Jalandhari.[177]\nPhilippines"
    },
    {
      "type": "paragraph",
      "text": "Poet Laureate of the Philippines include Cecilio Apóstol, Alberto Segismundo Cruz (1945), and Amado Yuzon (1959).[178][179] For cities, Abdon Balde Jr. became the Poet Laureate of Albay in 2012.\nSaudi Arabia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Saudi Arabia include Ahmed Ibrahim al-Ghazzawi.[180]\nSri Lanka"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Sri Lanka include Thotagamuwe Sri Rahula Thera, who lived during the 15th century.[181]\nSyria"
    },
    {
      "type": "paragraph",
      "text": "During the 10th century, Al-Mutannabi was the poet laureate at the court of the Hamdanid emir Sayf al-Dawla in Aleppo.[182] In the 12th century, during the Nizari Ismaili era in Masyaf, Mazyad al-Hilli al-Asadi was the poet laureate of Rashid ad-Din Sinan.[183][184]\nTaiwan"
    },
    {
      "type": "paragraph",
      "text": "In 1963, Jun-an (Wei Qing-de) was named the poet laureate of Taiwan by the United Poets Laureate International.[185] The organization was founded by Taiwanese poet Zhong Dingwen and Filipino poet Amado Yuzon.[186][187] In 2004, Taiwanese Yu Hsi was awarded Poet Laureate by the Seoul World Academy of Arts and Culture.[188]\nTajikistan"
    },
    {
      "type": "paragraph",
      "text": "In ancient times, Tajikistan-born Rudaki became the poet laureate in the royal court of Ahmad Samani.[189]\nThailand"
    },
    {
      "type": "paragraph",
      "text": "Si Prat serve as the court poet of King Narai during the 17th century. Poets laureate of Thailand include Sunthorn Phu.[190][191]\nTurkey"
    },
    {
      "type": "paragraph",
      "text": "During the 12th century, Nicholas Kallikles was the court poet of the Byzantine court in Constantinople during the reigns of Alexios I Komnenos. In 1302, Safi al-Din al-Hilli served as the court poet in Mardin under the Artuqids. Mehmet Akif Ersoy (b. 1873–d. December 27, 1936), a famous poet, was the Poet-Laureate of Turkey. He composed the poem to be the National Anthem of the Turkish Republic that written in 1921. Original name of the poem is \"İstiklal Marşı\"\nTurkmenistan"
    },
    {
      "type": "paragraph",
      "text": "In the 12th century, Rashid al-Din Vatvat became the poet laurete of the court in Gurganj under Il-Arslan (in what is now Turkmenistan).[192] Poets laureate of Turkmenistan include Gozel Shagulyeva.[193]\nUnited Arab Emirates"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of the United Arab Emirates include Ousha bint Khalifa Al Suwaidi.[194]\nUzbekistan"
    },
    {
      "type": "paragraph",
      "text": "In the 14th century, Uzbekistan-born Abu Sulayman Banakati was appointed poet laureate of Ghazan Khan court. In the 14th-15th centuries, Uzbekistan-born Khoja Fakhriddin Ismatullah ibn Masud Ismat Bukhari was the poet laureate in the royal courts of Jalal-ud-Din Khalji and Ulugh Beg.[195] In later history, poets laureate of Uzbekistan include Muhammad Ali and Śukrullo.[196][197]\nVietnam"
    },
    {
      "type": "paragraph",
      "text": "During the 16th century, Nguyễn Bỉnh Khiêm became the first Poet Laureate of Vietnam.[198] Tố Hữu was the poet laureate of North Vietnam and the Communist Party of Vietnam, and remained so even after his political decline.[199]\nYemen"
    },
    {
      "type": "paragraph",
      "text": "Ibn 'Aliwa-Ibn Hayyan was the court poet of the Banu Hamdan in northern Yemen.[200] During the 15th century, Abu Bakr al-Aydarus became the patron saint and Poet Laureate of Aden, Yemen.[201]\nEurope\nAlbania"
    },
    {
      "type": "paragraph",
      "text": "During the 15th-16th centuries, Albania-born Mesihi of Prishtina was appointed as the court poet of the Grand Vizier Khadim Ali Pasha.[83] In 2021, Rudolf Marku became the first Poet Laureate of Albania.[202] He was followed by Luljeta Lleshanaku.[203]\nAustria"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Austria include Franz Grillparzer, Kurt Wildgans and Franz Werfel.[204][205][206] For cities, Paulus Melissus was made Poet Laureate of Vienna in 1561.[207]\nBelarus"
    },
    {
      "type": "paragraph",
      "text": "Poets Laureate of Belarus include Maksim Tank and Pimen Panchenko.[208][209]\nBelgium"
    },
    {
      "type": "paragraph",
      "text": "Around 1914, several sources cited Marguerite Coppin as the Poet Laureate of Belgium.[210][211] The first Poet Laureate of Belgium, Charles Ducal, was chosen in 2014.[212][213] He was followed by Laurence Vielle,[212] Els Moors,[212] Carl Norac,[214] and Mustafa Kör.[214]\nBosnia and Herzegovina"
    },
    {
      "type": "paragraph",
      "text": "Radovan Karadžić was the Poet Laureate of Yugoslavia (particularly Republika Srpska of Bosnia and Herzegovina).[215][216]\nBulgaria"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Bulgaria include Venko Markovski.[217][218]\nCroatia"
    },
    {
      "type": "paragraph",
      "text": "During the 15th-16th century, Elio Lampridio Cerva (Ilija Crijević) was appointed as the Poet Laureate of the Republic of Ragusa.[219] Poets laureate of Croatia include Vladimir Nazor.[220] For cities, Peter Menčetić was the Poet Laureate of Dubrovnik.[221]\nCzech Republic"
    },
    {
      "type": "paragraph",
      "text": "In 1596, Bartholomaeus Bilovius was made Poet Laureate of Prague due in part to his royal connections.[222] Johann Christian Alois Mickl was crowned the Poet Laureate of Prague around 1730.[223]\nDenmark"
    },
    {
      "type": "paragraph",
      "text": "In the 16th century, Hieronymus Osius was appointed the poet laureate by King Christian III of Denmark.[224] Poets laureate of Denmark include Christian Winther.[225]\nEstonia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Estonia include Jaan Kaplinski.[226]\nFinland"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Finland include Zachris Topelius.[227]\nFrance"
    },
    {
      "type": "paragraph",
      "text": "Around 1324, Arnaut Vidal de Castelnou d'Ari became the first Poet Laureate of the Consistori del Gay Saber. Poets laureate of France include Publio Fausto Andrelini (1496), Pierre Gringore, Mellin de Saint-Gelais (appointed c. 1523 by Francis I of France), François de Malherbe (c. 1576), Giambattista Marino (1615–1623), Charles Dumas (1903), André Corthis (1906) and Paul Fort (1921).[228][229][230][231][232]\nGermany"
    },
    {
      "type": "paragraph",
      "text": "The first known Poet Laureate of the German Empire is Conradus Celtes Protuccius (c. 1466). He was succeeded by Matthäus Zuber, Adam Schröter (1560), Johann Heermann (1608), Johannes Paulus Crusius (1616), Johann Rist (1644), Johann Georg Ahle (1680), Apostolo Zeno and Pietro Metastasio (1729) among others.[224][233][234] Georg Christian Lehms was the court poet in Darmstadt, and Salomon Franck was a court poet during the 18th century. Regarding other cities, in the 1700s, Sidonia Hedwig Zäunemann was appointed as the Poet Laureate of Göttingen.[235] Poets laureate of Nazi Germany include Hanns Johst from 1935 to 1946. Rajvinder Singh [de] was declared the Stadtschreiber of three different cities in Germany: Rheinsberg in 1999,[236] Remscheid in 2004,[236] and Trier in 2007.[236][237][238][239][240][241]\nGreece"
    },
    {
      "type": "paragraph",
      "text": "In the 6th century, Simonides of Ceos was appointed as the poet laureate of the Scopadae and Aleuadae.[242][243] In the 12th century, Theodore Prodromos was appointed as the court poet during the reigns of John II Komnenos (1118–1143) and Manuel I Komnenos (1143–1180). Greece's modern poets laureate include Spyros Matsoukas (c. 1909) and Kostis Palamas.[244][245][246][247]\nHoly See\nMain article: Papal poet laureate"
    },
    {
      "type": "paragraph",
      "text": "Popes have several times named poets laureate, but the practice has been irregular.\nHungary"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Hungary include János Arany and Zsófia Balla (2018).[248][249]\nIceland"
    },
    {
      "type": "paragraph",
      "text": "In the 10th century, Hallfreðr vandræðaskáld was the court poet (skald) first of Hákon Sigurðarson, then of Óláfr Tryggvason and finally of Eiríkr Hákonarson. Eilífr Goðrúnarson was another court poet of Hákon Sigurðarson. Also, in the 10th century, Tindr Hallkelsson was the earl Hákon Sigurðarson. In the 11th century, Sigvatr Þórðarson was the court poet of King Olaf II of Norway, Canute the Great, Magnus the Good and Anund Jacob. Also, in the 11th century, Þórarinn loftunga was the court poet of King Canute and Sveinn Knútsson. Other 11th century court poets include Þjóðólfr Arnórsson and Arnórr jarlaskáld. Poets laureate of Iceland include Einar Benediktsson and Stephan G. Stephansson.[250][251]\nIreland"
    },
    {
      "type": "paragraph",
      "text": "The Kingdom of Ireland had a poet laureate; the last holder of the title was Robert Jephson, who died in 1803.[252]"
    },
    {
      "type": "paragraph",
      "text": "The closest modern equivalent in Ireland is the title Saoi [\"wise one\"] held by up to seven members at a time of Aosdána, an official body of those engaged in fine arts, literature, and music. Poets awarded the title include Máire Mhac an tSaoi, Anthony Cronin, and Seamus Heaney. In terms of districts, Rachael Hegarty is the Poet Laureate of Dublin 1.[253]\nItaly"
    },
    {
      "type": "paragraph",
      "text": "During the 13th century, France-born Raimbaut de Vaqueiras served as the court poet of Boniface I of Montferrat. Poets laureate of Italy include Albertino Mussato, Petrarch (1341), Camillo Querno (1514), Torquato Tasso (1595), Maria Maddalena Morelli Fernandez (1776) and Giovanni Prati (1849).[234][254][255] In 1452, Niccolò Perotti was made Poet Laureate of Bologna.[256] In the 16th century, Bernardo Bellincioni was appointed as the court poet for Lorenzo the Magnificent in Florence and Ludovico Sforza.\nLatvia"
    },
    {
      "type": "paragraph",
      "text": "Jānis Sudrabkalns was the Poet Laureate of Latvian SSR.[257][258]\nLithuania"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Lithuania include Bernardas Brazdzionis and Kornelijus Platelis.[259][260]\nLuxembourg"
    },
    {
      "type": "paragraph",
      "text": "In 1555, Luxembourg-born Nicolaus Mameranus was crowned poet laureate by Charles V.[261]\nMalta"
    },
    {
      "type": "paragraph",
      "text": "In 2023, Maria Grech Ganado became the inaugural Poet Laureate of Malta.[262]\nMoldova"
    },
    {
      "type": "paragraph",
      "text": "Moldova-born Adrian Păunescu was the poet laureate of Romanian politician Nicolae Ceaușescu.[263]\nMontenegro"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Montenegro include Tomo Joshov Vulkichevich.[264]\nNetherlands\nMain article: Dichter des Vaderlands"
    },
    {
      "type": "paragraph",
      "text": "The unofficial Poet Laureate of Netherlands is Tsead Bruinja as Dichter des Vaderlands (Poet of the Fatherland). The previous laureate was Ester Naomi Perquin. Gerrit Komrij was the first Dichter des Vaderlands. The title was created by Dutch media.[citation needed] In terms of cities, Hester Knibbe served as the Poet Laureate of Rotterdam.[265]\nNorway"
    },
    {
      "type": "paragraph",
      "text": "During the 9th century, Þorbjǫrn hornklofi was appointed as a court poet (skald) of King Harald Fairhair. In the 11th century, Valgarðr á Velli was the court poet of King Harald Hardrada of Norway. Poets laureate of Norway include Arnold Eidslott (1986–2018).[266]\nPoland"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Poland were appointed so by Popes: Klemens Janicki (Pope Paul III; 1540), Adam Schröter (Pope Pius IV; 1564), and Maciej Kazimierz Sarbiewski (Pope Urban VIII, 1622).[267] Italy-born Carlo Sigismondo Capece was the court poet of Queen Maria Casimira of Poland.\nPortugal"
    },
    {
      "type": "paragraph",
      "text": "In 1769, Italy-born Gaetano Martinelli was appointed as the court poet of Joseph I of Portugal and his daughter Maria I. Poets laureate of Portugal include Gil Vicente and Garcia de Resende.[268][269][270]\nRomania"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Romania include Vasile Alecsandri (1848–1881) and Octavian Goga.[271][272][273][274]\nRussia"
    },
    {
      "type": "paragraph",
      "text": "In the 18th century, Vasily Zhukovsky was a court poet during the Russian Empire. Poets laureate of Russia include Gavrila Derzhavin and Mikhail Sholokhov.[275][276][277] In 1923, Mӓjit Nurghӓniulї Ghafuri was appointed the Poet Laureate of Bashkir Autonomous Soviet Socialist Republic.[278]\nSan Marino"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of San Marino include Valery Larbaud.[279][280]\nSerbia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Serbia include the following:"
    },
    {
      "type": "paragraph",
      "text": "    Matija Bećković[281]\n    Charles Simić[282]\n    Slobodan Selenić[283]\n    Jovan Dučić[284]"
    },
    {
      "type": "paragraph",
      "text": "Slovakia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Slovakia include Pavol Országh Hviezdoslav.[285][286]\nSlovenia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Slovenia include France Prešeren.[287]\nSpain"
    },
    {
      "type": "paragraph",
      "text": "Mu'min ibn Said was the court poet of Córdoba under Muhammad I (d. 886) [an amir of the Emirate of Córdoba].[288] In the 11th century in Spain, Ibn Darraj al-Qastalli was appointed as the court poet of Almanzor.[289] During the 13th century, Cerverí de Girona was appointed as the court poet of James the Conqueror and Peter the Great. Poets Laureate of Spain include Juan Eugenio Hartzenbusch (1869), José Zorrilla y Moral (1889), and Carolina Coronado.[290][291][292] José María Pemán was designated as the Poet Laureate of the Franco regime.[293]\nSweden"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Sweden include Pehr Henrik Ling and Verner von Heidenstam (1916).[294][295]\nSwitzerland"
    },
    {
      "type": "paragraph",
      "text": "In 1512, Switzerland-born Heinrich Glarean was appointed a poet laureate by Emperor Maximilian I.[296]\nUkraine"
    },
    {
      "type": "paragraph",
      "text": "Stanisław Trembecki was the poet laureate in the court of Tulchyn (a region now located in modern-day Ukraine).[297] In the 1940s, Oleksandr Korniychuk was the Poet Laureate of Soviet-controlled Ukraine.[298] For cities, Sofia Vladimirovna was the Poet Laureate of Henichesk.[299]\nUnited Kingdom\nMain article: Poet Laureate of the United Kingdom\nEngland\nPortrait of Geoffrey Chaucer of England"
    },
    {
      "type": "paragraph",
      "text": "In England, the term \"poet laureate\" is restricted to the official office of Poet Laureate, attached to the royal household. However, no authoritative historical record exists of the office of Poet Laureate of England."
    },
    {
      "type": "paragraph",
      "text": "The office developed from earlier practice when minstrels and versifiers were members of the king's retinue. Richard Cœur-de-Lion had a versificator regis (English: king's poet), Gulielmus Peregrinus (William the Pilgrim), and Henry III had a versificator named Master Henry. In the fifteenth century, John Kay, a versifier, described himself as Edward IV's \"humble poet laureate\". According to Notes and Queries (1876), King Henry I paid 10 shillings a year to a versificator regis.[300]"
    },
    {
      "type": "paragraph",
      "text": "Geoffrey Chaucer (1340–1400) was called Poet Laureate, being granted in 1389 an annual allowance of wine. W. Hamilton describes Chaucer, Gower, Kay, Andrew Bernard, John Skelton, Robert Whittington, Richard Edwards and Samuel Daniel as \"volunteer Laureates\"."
    },
    {
      "type": "paragraph",
      "text": "John Skelton studied at the University of Oxford in the early 1480s and was advanced to the degree of \"poet laureate\" in 1488, when he joined the court of King Henry VII to tutor the future Henry VIII. The title of laureate was also conferred on him by the University of Louvain in 1492 and by the University of Cambridge in 1492–3.[301] He soon became famous for his rhetoric, satire and translations and was held in high esteem by the printer William Caxton, who wrote, in the preface to The Boke of Eneydos compyled by Vargyle (Modern English: The Book of the Aeneid, compiled by Virgil) (1490):"
    },
    {
      "type": "paragraph",
      "text": "    But I pray mayster John Skelton, late created poete laureate in the unyversite of Oxenforde, to oversee and correct this sayd booke."
    },
    {
      "type": "paragraph",
      "text": "The academic use of the term laureate became associated again with royalty when King James I created a pension for Ben Jonson in 1617, although there is no formal record extant. He was succeeded by William Davenant."
    },
    {
      "type": "paragraph",
      "text": "The royal office Poet Laureate was officially conferred by letters patent on John Dryden in 1668, after Davenant's death, and the post became a regular institution. There are other, non-official, laureate titles, such as the commercially sponsored \"Children's Laureate\" for an \"eminent writer or illustrator of children's books to celebrate outstanding achievement in their field\",[302] and the Poetry Foundation's Young People's Poet Laureate.[5]\nScotland\nMain article: Makar (National Poet for Scotland)\nEdwin Morgan, first Makar or National Poet for Scotland"
    },
    {
      "type": "paragraph",
      "text": "Scotland has a long tradition of makars and poetry. Iain Lom, the Scottish Gaelic bard, was appointed poet laureate in Scotland by King Charles II of England, Scotland and Ireland on his restoration in 1660.[303] In 2004 the Scottish Parliament appointed Professor Edwin Morgan as the first Makar or National Poet for Scotland. On his death in January 2011 he was succeeded by Liz Lochhead.[304] Jackie Kay followed Lochhead as Makar in 2016,[305] and was then herself succeeded by Kathleen Jamie, who became Scotland's fourth Makar in 2021.[306] In 2024, Pàdraig MacAoidh (Peter Mackay) became the fifth Makar.[307] For cities, in 2014, Jim Carruth was appointed as the Poet Laureate of Glasgow.[308]\nWales\nMain article: National Poet for Wales"
    },
    {
      "type": "paragraph",
      "text": "Wales has had a long tradition of poets and bards under royal patronage, with extant writing from medieval royal poets and earlier. Gwalchmai ap Meilyr was the court poet of Owain Gwynedd during the 12th century. Y Prydydd Bychan was a medieval Welsh court poet in the 13th century."
    },
    {
      "type": "paragraph",
      "text": "The office of National Poet for Wales was established in April 2005. The first holder, Gwyneth Lewis, was followed by Gwyn Thomas. The role of Bardd Plant Cymru, the Welsh-language children's poet laureate was established in 2000.[309] A corresponding English-language role, Children's Laureate Wales was established in 2019.[310]\nTerritories\nBritish Virgin Islands"
    },
    {
      "type": "paragraph",
      "text": "Dr. Richard Georges became the inaugural Poet Laureate of the British Virgin Islands in 2020.[311]\nCayman Islands"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of the Cayman Islands include Roy Bodden.[312]\nFalkland Islands"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of the Falkland Islands include Ron Reeves.[313]\nIsle of Man"
    },
    {
      "type": "paragraph",
      "text": "Referred to as the Manx Bard, the individuals that have served in the position include Zoe Cannell, Michael Manning, Jordanne Kennaugh and Boakesey Closs.[314][315][316][317]\nNorth America\nAruba"
    },
    {
      "type": "paragraph",
      "text": "In 2025, John Freddy Montoya was named Aruba’s “Poet of the Fatherland” (Dichter des Vaderlands).[318]\nBahamas"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of The Bahamas include Henry Christopher Christie.[319]\nBarbados"
    },
    {
      "type": "paragraph",
      "text": "The first Poet Laureate of Barbados was chosen in 2018. Her name is Esther Phillips.[320][321]\nCanada\nToronto's Poet Laureate George Elliott Clarke who later became Parliamentary Poet Laureate of Canada\nMain article: Canadian Parliamentary Poet Laureate"
    },
    {
      "type": "paragraph",
      "text": "The Canadian Parliamentary Poet Laureate is appointed as an officer of the Library of Parliament. The position alternates between an English and French speaking laureate. Candidates must be able to write in both English and French, have a substantial publication history (including poetry) displaying literary excellence and have written work reflecting Canada, among other criteria.[322]\nProvincial and municipal poets laureate\nMain article: List of Canadian provincial poets laureate"
    },
    {
      "type": "paragraph",
      "text": "Currently, only the provinces of Ontario, Prince Edward Island, Saskatchewan and Yukon have appointed a poet laureate.\nAlberta\nMain article: Municipal poets laureate in Alberta\nBritish Columbia\nMain article: Municipal poets laureate in British Columbia\nManitoba cities"
    },
    {
      "type": "paragraph",
      "text": "    Poets laureate of Winnipeg include Di Brandt (2018–2019), Duncan Mercredi (2020–2022), and Chimwemwe Undi (2023-2024).[323]"
    },
    {
      "type": "paragraph",
      "text": "New Brunswick cities"
    },
    {
      "type": "paragraph",
      "text": "    Poets laureate of Fredericton include Ian Letourneau (2016–2018), Jenna Lyn Albert (2019–2021) and Jordan Trethewey (2021–present).\n    Poets flyé-es (poets laureate) of Moncton include Kayla Geitzler (English) and Jean-Philippe Raîche (French) (2019–present) [324]\n    Poets laureate of Sackville include Douglas Lochhead (2002–2011), Marilyn Lerch (2013–2017), Shoshanna Wingate (2019–2021) and Laura K. Watson (2021–present).[325][326]"
    },
    {
      "type": "paragraph",
      "text": "Newfoundland and Labrador cities"
    },
    {
      "type": "paragraph",
      "text": "    Poets laureate of St. John's include Agnes Walsh (2006–2009), Tom Dawe (2010–2013), George Murray (2014–2017), and Mary Dalton (2019–2022).[327]"
    },
    {
      "type": "paragraph",
      "text": "Nova Scotia cities\nMain article: Poet Laureate of Halifax, Nova Scotia"
    },
    {
      "type": "paragraph",
      "text": "    Rita Joe (1932 – 2007) was appointed Lifetime \"Poet Laureate of the Mi'kmaq people\" in Cape Breton.[328][329]"
    },
    {
      "type": "paragraph",
      "text": "Ontario\nMain article: Poet Laureate of Ontario\nMain article: Municipal poets laureate in Ontario\nPrince Edward Island"
    },
    {
      "type": "paragraph",
      "text": "Prince Edward Island appointed its first poet laureate, John Smith, in 2003.[330][331][332]"
    },
    {
      "type": "paragraph",
      "text": "    Julie Pellissier-Lush (2019–present)\n    Deirdre Kessler (2016–2019)\n    Diane Hicks Morrow (2013–2016)\n    Hugh MacDonald (2009–2013)\n    David Helwig (2008–2009)\n    Frank Ledwell (2004–2007)\n    John Smith (2002–2004)"
    },
    {
      "type": "paragraph",
      "text": "Saskatchewan"
    },
    {
      "type": "paragraph",
      "text": "Saskatchewan appointed its first poet laureate, Glen Sorestad, in 2000.[333]"
    },
    {
      "type": "paragraph",
      "text": "    Carol Rose GoldenEagle (2021–present)\n    Bruce Rice (2019 - 2021)\n    Brenda Schmidt (2017 - 2018)\n    Gerry Hill (2016 - 2017)\n    Judith Krause (2014 - 2015)\n    Don Kerr (2011 - 2013)\n    Robert Currie (2007 - 2010)\n    Louise B. Halfe (Sky Dancer) (2005 - 2006)\n    Glen Sorestad (2000 - 2004)"
    },
    {
      "type": "paragraph",
      "text": "Yukon"
    },
    {
      "type": "paragraph",
      "text": "Inaugural Yukon Provincial Poet Laureate PJ Yukon has held the office since 1994.[334][333]"
    },
    {
      "type": "paragraph",
      "text": "The Commissioner of Yukon established the Story Laureate of Yukon role in 2020.[335] The inaugural position was held by Michael Gates.\nCosta Rica"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Costa Rica include Laureano Albán.[336]\nCuba"
    },
    {
      "type": "paragraph",
      "text": "National poets are mainly celebrated in Cuba, but there are poets laureate in the country's history. In 1860, Gertrudis Gómez de Avellaneda was made the Poet Laureate of Havana.[337] Nicolás Guillén, who is mainly considered a national poet, became the Poet Laureate of Havana in 1913.[338][339]\nDominican Republic"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Dominican Republic include Pedro Mir (1984).\nEl Salvador"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of El Salvador include Alberto Rivas Bonilla.[340][341]\nGuatemala"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Guatemala include Osmundo Arriola and Máximo Soto Hall.[342][343]\nHaiti"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Haiti include Jean-Fernand Brierre.[344][345]\nHonduras"
    },
    {
      "type": "paragraph",
      "text": "In 1846, José Trinidad Reyes was appointed the Poet Laureate of Honduras.[346] His successors include Froylán Turcios (c. 1922).[347]\nJamaica"
    },
    {
      "type": "paragraph",
      "text": "Thomas MacDermot was the first poet laureate of Jamaica during colonial times, followed by J. E. Clare McFarlane.[348] Mervyn Morris was the first poet laureate of Jamaica upon its independence (2014–2017), followed by Lorna Goodison (2017–2020)[348] and Olive Senior (2021–2024).[349] The current poet laureate is Kwame Dawes (2024–2027).[350]\nMartinique"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Martinique include Daniel Thaly.[351][352]\nMexico"
    },
    {
      "type": "paragraph",
      "text": "In the 15th century, Nezahualcoyotl was the Poet Laureate of the Aztecs.[353][354] Poets laureate of Mexico include Guillermo Prieto (1890), Juan de Dios Peza, and Rafael de Zayas Enriquez.[355][356][357][358][359] Ramón Modesto López Velarde Berumen was the Poet Laureate of Jerez de García Salinas, Zacatecas.[360] Enrique González Martínez was the Poet Laureate of Mexico City.[361] Félix Martínez Dolz was the Poet Laureate of Oaxaca.[362] In 2019, Gerardo de Jesús Monroy became the Poet Laureate of Torreón, Coahuila.[363]\nNicaragua"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Nicaragua include Agenor Argüello and Juan de Dios Vanegas.[364][365]\nPanama"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Panama include Enrique Geenzier.[366]\nSaint Lucia\nDerek Walcott of Saint Lucia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Saint Lucia include Derek Walcott.[367][368]\nTrinidad and Tobago"
    },
    {
      "type": "paragraph",
      "text": "Paul-Keens Douglas became the inaugural Poet Laureate of Trinidad and Tobago in 2017.[369][370] In 2002, Eintou Pearl Springer was named the Poet Laureate of Port of Spain, Trinidad and Tobago.[371] The inaugural Poet Laureate of the Port of Spain was Anson Gonzalez.[369]\nUnited States\nJoy Harjo, Poet Laureate of the United States\nLibrarian of Congress Carla Hayden, Poet Laureate Tracy K. Smith, and National Youth Poet Laureate Amanda Gorman.\nMain article: United States Poet Laureate\nFurther information: List of U.S. state poets laureate"
    },
    {
      "type": "paragraph",
      "text": "The United States Library of Congress appointed a Consultant in Poetry to the Library of Congress from 1937 to 1984. An Act of Congress changed the name in 1985 to Poet Laureate Consultant in Poetry to the Library of Congress."
    },
    {
      "type": "paragraph",
      "text": "Poets laureate receive a US$35,000 stipend and are given the responsibility of overseeing an ongoing series of poetry readings and lectures at the library, and a charge to promote poetry. No other duties are specified, and laureates are not required to compose for government events or in praise of government officials. However, after the September 11 terrorist attacks, then poet laureate Billy Collins was asked to write a poem to be read in front of a special joint session of Congress. Collins wrote \"The Names\", which he read on September 6, 2002, and which is available in streaming audio and video.[372] The original intent of the stipend was to provide poets laureate with a full income, so that they could devote their time entirely to writing poetry. The amount has not been adjusted for inflation and is now considered a moderate bonus intended to supplement a poet's already existing income."
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of the United States include Ada Limón, Joy Harjo, Tracy K. Smith and Juan Felipe Herrera. Amanda Gorman was the United States's first National Youth Poet Laureate appointed in 2017.[373]"
    },
    {
      "type": "paragraph",
      "text": "A number of American state legislatures have also created an office of poet laureate. The holders may be locally or nationally prominent. The U.S. states of New Jersey, Massachusetts, and Pennsylvania do not have positions, while South Dakota and South Carolina's positions are currently vacant.[374]\nOceania\nAustralia"
    },
    {
      "type": "paragraph",
      "text": "On January 30, 2023, at the launch of 'Revive', Australia's new cultural policy, Prime Minister Anthony Albanese announced \"the establishment of a poet laureate for Australia\".[375] Before 2023, Australia had not had an official poet laureate scheme, despite past suggestions.[376][377] In 1818, former convict Michael Massey Robinson was paid by colony governor Lachlan Macquarie for services as poet laureate.[378] Over the years, other poets have been nominated as worthy of such a title, including James Brunton Stephens (1835–1902),[379] Andrew Barton 'Banjo' Paterson (1864–1941),[380] and Les Murray (1938–2019).[381]\nFiji"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Fiji include Kamla Prasad Mishra.[382][383]\nKiribati"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Kiribati include Danny Wilson.[384]\nNew Zealand\nMain article: New Zealand Poet Laureate"
    },
    {
      "type": "paragraph",
      "text": "New Zealand has had an official poet laureate since 1998. Originally sponsored by Te Mata vineyards and known as the Te Mata Estate Poet Laureate, the award is now administered by the National Library of New Zealand and the holder is called New Zealand Poet Laureate. The term of office is two years. The symbol of office is a Tokotoko, a carved wooden ceremonial orator's staff."
    },
    {
      "type": "paragraph",
      "text": "The first holder was Bill Manhire, in 1998–99, then Hone Tuwhare (2000–01), Elizabeth Smither (2002–03), Brian Turner (2004–05), Jenny Bornholdt (2006–07), Michele Leggott (2008–09), Cilla McQueen (2009–11), Ian Wedde (2011–13), Vincent O'Sullivan (2013–15), C. K. Stead (2015–2017), Selina Tusitala Marsh (2017–2019), David Eggleton (2019–2021) and Chris Tse (2022–2024).[385][386][387][388]\nPapua New Guinea"
    },
    {
      "type": "paragraph",
      "text": "Allan Natachee was proclaimed the Poet Laureate of Papua New Guinea by the United Poets Laureate International.[389][390]\nTonga"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Tonga include Noble Tu'ivakanō (Siaosi Kiu Ngalumoetutulu Kiutauʻivailahi Kao).[391]\nSouth America\nArgentina"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Argentina include Olegario Victor Andrade and Carlos Guido y Spano.[392][393]\nBolivia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Bolivia include Javier del Granado.[394]\nBrazil"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Brazil include Guilherme de Almeida.[395][396]\nChile"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Chile include Galvarino Merino Duarte (c. 1983).[397]\nColombia"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Colombia include Antonio José Restrepo.[398][399]\nEcuador"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Ecuador include Remigio Crespo Toral (1917), Pablo Hannibal Vela (1951), and José María Egas (1976).[400][401][402]\nGuyana"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Guyana include A.J. Seymour.[403]\nParaguay"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Paraguay include Alejandro Guanes.[404][405]\nPeru"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Peru include Pedro Peralta y Barnuevo, José Santos Chocano (1922), and Dennis Siluk.[406][407][408]\nSuriname"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Suriname include Robin \"Dobru\" Ravales.[409][410]\nUruguay"
    },
    {
      "type": "paragraph",
      "text": "In 1929, the Palacio Legislativo of Montevideo consecrated Juana de Ibarbourou as the \"Poet Laureate of Spanish America\".[411]\nVenezuela"
    },
    {
      "type": "paragraph",
      "text": "Poets laureate of Venezuela include Heraclio Martín de la Guardia (c. 1878).[412]\nSee also"
    },
    {
      "type": "paragraph",
      "text": "    National poet\n    Griot\n    Imbongi\n    Skald"
    },
    {
      "type": "paragraph",
      "text": "References"
    },
    {
      "type": "paragraph",
      "text": "\"POET LAUREATE definition and meaning | Collins English Dictionary\".\n\"Poet laureate Definition & Meaning - Merriam-Webster\".\nPublishers, HarperCollins. \"The American Heritage Dictionary entry: poet laureate\". www.ahdictionary.com.\nRobert Weiss, The Renaissance Discovery of Classical Antiquity (Oxford, 1973);Ernest Hatch Wilkins, The Making of the Canzoniere and Other Petrarchan Studies 1951:9-69, noted in Weiss 1973:32.\n\"Young People's Poet Laureate\". Poetry Foundation. Retrieved May 4, 2019.\n\"Current Poet Laureate\". Pikes Peak Poet Laureate. Archived from the original on March 1, 2013.\n\"Poet Laureate « the League of Minnesota Poets\". Archived from the original on June 26, 2012. Retrieved August 15, 2012.\n\"Poet Laureate\". Northampton Arts Council. Retrieved April 1, 2024.\n\"Our Purpose\". Northampton Arts Council. Retrieved April 1, 2024.\nRobert Weiss, The Renaissance Discovery of Classical Antiquity (Oxford, 1973) 20.\nErnest Hatch Wilkins, The Making of the Canzoniere and Other Petrarchan Studies 1951:9-69, noted in Weiss 1973:32.\nHamilton, Walter (1880). \"The Origin of the Office of Poet Laureate\". Transactions of the Royal Historical Society. 8: 20–35. doi:10.2307/3677823. ISSN 0080-4401.\nWeiss 1973.\n\"COURTS AND COURTIERS x. Court poetry\". iranicaonline.org. Retrieved October 23, 2024.\n\"About the Poet Laureate\". poetlaureate.illinois.gov. Retrieved October 16, 2024.\nMagerøy, Hallvard (August 16, 2024), \"skaldedikting\", Store norske leksikon (in Norwegian), retrieved October 26, 2024\n外国文学研究 (in Chinese). 外国文学交流杂志社. 1984.\n大辭典 (in Japanese). 平凡社. 1934.\n大辭典: クナーコサン (in Japanese). 平凡社. 1953.\n中西進 (August 21, 2019). 英文版 『美しい日本語の風景』他所収: Reflections on Quintessential Words. Japan Publishing Industry Foundation for Culture. ISBN 978-4-86658-068-5.\n多ケ谷, 有子 (March 2012). \"朗詠としての「歌会始」 : 詩歌と朗詠の伝統 : 桂冠詩人と「歌会始」\". 関東学院大学文学部紀要 (in Japanese). 124: 61–103.\nBrandel, R. (November 11, 2013). The Music of Central Africa: An Ethnomusicological Study: Former French Equatorial Africa the Former Belgian Congo, Ruanda-Urundi Uganda, Tanganyika. Springer Science & Business Media. ISBN 978-94-015-7396-2.\nJournal of African Languages. Macmillan. 1967.\nContemporary African Literature. Three Continents Press. 1983. ISBN 978-0-89410-369-8.\n\"J. J. R. JOLOBE\". pzacad.pitzer.edu. Retrieved October 16, 2024.\nMadureira, Luis (2023). \"The Real Tragedy of Historical Contingency\": Rehearsing the Failed Revolution in Postcolonial Angolan Theater*\". Journal of Lusophone Studies. 8 (1): 5–29.\nChandan, MD Shahnawaz Khan (August 30, 2013). \"The Life of a Rebel\". The Daily Star. Retrieved October 26, 2024.\nThe Theosophist. Theosophical Publishing House. 1918.\nLiteratura: revista do escritor brasileiro (in Brazilian Portuguese). Gráfica Scortecci. 2005.\nMurray, Eóin. \"Obligations of Love, Obligations of Politics | Poetry Ireland\". www.poetryireland.ie. Retrieved October 17, 2024.\n\"MIFTAH - In Memoriam: Palestine's Poet Laureate Mahmoud Darwish\". MIFTAH. Retrieved October 17, 2024.\nStille, Alexander (April 1, 2003). The Future of the Past. Farrar, Straus and Giroux. ISBN 978-1-4668-1709-8.\nQuayum, Mohammad A. (2007). Peninsular Muse: Interviews with Modern Malaysian and Singaporean Poets, Novelists and Dramatists. Peter Lang. ISBN 978-3-03911-061-2.\nCongressional Record: Proceedings and Debates of the ... Congress. U.S. Government Printing Office. 1963.\nWilliams, Mark (October 23, 2020). \"Bangladesh: 91st birthday of poet Shamsur Rahman\". The New Publishing Standard. Retrieved October 26, 2024.\nSouth and West. South and west. 1964.\n\"Cha: An Asian Literary Journal - End Games: Leung Ping-kwan's City at the End of the Time\". www.asiancha.com. Retrieved April 30, 2025.\nLoney, Hannah; Mendes, Nuno Canas. Timor-Leste 1999: 20 Years On tlsa Timor-Leste Studies Association Understanding Hatene kona ba Compreender Timor-Leste 2019 Volume II.\n\"Between Worlds\". The Poetry Foundation. Retrieved October 20, 2024.\n\"Samoan poet embraces new role\". Samoa Observer. Retrieved July 11, 2025.\nمحمد, حمود، (2001). موسوعة الأدباء والشعراء العرب (in Arabic). دار الفكر اللبناني،.\nBelcher, Stephen (October 22, 1999). Epic Traditions of Africa. Indiana University Press. ISBN 978-0-253-21281-8.\nNantet, Jacques (1972). Panorama de la littérature noire d'expression française (in French). Fayard.\nLima-Neves, Terza A. Silva (May 15, 2024). Cabo Verdeans in the United States: Twenty-First-Century Critical Perspectives. Lexington Books. ISBN 978-1-6669-4299-6.\n\"Ahmed Shawqi .. The Prince of Poets\". thelevantnews.com. Retrieved August 29, 2024.\nZeitlin, Stephen J. (March 2003). \"The People's Poetry\". Oral Tradition. 18 (1): 6–13. doi:10.1353/ort.2004.0045.\n\"Tsegaye Gabre-Medhin\". tsegaye.se. Retrieved August 21, 2019.\nCultures of the Commonwealth: Essays and Studies. Cultures of the Commonwealth. 1998.\nSeligson, Judith (March 8, 2021). Gaps and the Creation of Ideas: An Artist's Book. Cambridge Scholars Publishing. ISBN 978-1-5275-6723-8.\nDavid Mungoshi, \"Tribute to Ghana's poet laureate Atukwei Okai\",The Herald (Zimbabwe), 31 July 2018.\nKnappert, Jan (2005). Swahili Culture. E. Mellen Press. ISBN 978-0-7734-6193-2.\nLesotho Clippings. Documentation and Publications Division, Institute of Southern African Studies, National University of Lesotho. 1982.\nEncyclopedia of African Peoples. Routledge. November 26, 2013. ISBN 978-1-135-96341-5.\n\"Melvin B. Tolson | Kansas City Black History\". kcblackhistory.org. Retrieved September 12, 2024.\n\"Liberia's Poet Laureate, Patricia Jabbeh Wesley, to present at Shenango | Penn State University\". www.psu.edu. Retrieved September 12, 2024.\nالوسط, بوابة. \"كاليماخوس القوريني.. شاعر ليبي الموطن\". Alwasat News (in Arabic). Retrieved October 17, 2024.\nForeign Service Journal. American Foreign Service Association. 1967.\nImmink, Bodo (2003). From Freedom to Empowerment: Ten Years of Democratisation in Malawi ; Proceedings of the Conference Held from 4th to 6th June 2003 at Capital Hotel, Lilongwe. Forum for Dialogue and Peace, Konrad Adenauer Foundation, Malawi-German Programme for Democracy and Decentralisation, National Initiative for Civic Education. ISBN 978-99908-58-26-6.\nAusten, Ralph A. (1999). In Search of Sunjata: The Mande Oral Epic as History, Literature and Performance. Indiana University Press. ISBN 978-0-253-33452-7.\nSisòkò, Fa-Digi (1986). The Epic of Son-Jara: A West African Tradition. Indiana University Press. ISBN 978-0-253-31951-7.\n\"الشاعر محمد ولد الطالب : يشرفني ان اكون شاعر بلاط الرئيس محمد ولد عبد العزيز .\" بلّوار ميديا : BellewarMedia (in Arabic). Retrieved October 12, 2024.\nToorawa, Shawkat M. (2001). \"Is Multiculturalism Bad for Art?: Carl de Souza's La Maison qui marchait vers le large and the Mauritian City\". L'Esprit Créateur. 41 (3): 197–206. ISSN 1931-0234.\nLandau, Rom (1967). Morocco: Marrakesh, Fez, Rabat. Elek. ISBN 978-0-236-30866-8.\nSesan (June 4, 2018). \"For Ayo Banjo, Nobel prize dream for Osundare\". Punch Newspapers. Retrieved October 10, 2024.\nFEATURE: Inside Niyi Osundare's book of truth as trouble. (2024, May 30). Premium Times (Abuja, Nigeria). Available from NewsBank: Access World News: https://infoweb.newsbank.com/apps/news/document-view?p=AWNB&docref=news/1996441716A07330.\nThe African Guardian. Guardian Magazines. 1986.\nMoolla, F. Fiona (June 1, 2016). Natures of Africa: Ecocriticism and animal studies in contemporary cultural forms. NYU Press. ISBN 978-1-86814-914-8.\nMani, Rama; Weiss, Thomas G. (March 1, 2013). Responsibility to Protect: Cultural Perspectives in the Global South. Routledge. ISBN 978-1-136-66121-1.\nVansina, Jan (March 9, 2005). Antecedents to Modern Rwanda: The Nyiginya Kingdom. Univ of Wisconsin Press. ISBN 978-0-299-20123-4.\nPressley-Sanon, Toni; Saint-Just, Sophie (December 3, 2015). Raoul Peck: Power, Politics, and the Cinematic Imagination. Lexington Books. ISBN 978-0-7391-9879-7.\n\"Léopold Senghor | Senegal's 1st President & Poet Laureate | Britannica\". www.britannica.com. Retrieved September 13, 2024.\nBuck, Christopher; Smith, Derik (September 26, 2017), \"Hayden, Robert\", Oxford Research Encyclopedia of Literature, ISBN 978-0-19-020109-8, retrieved September 13, 2024\nRedazione. \"La Sierra Leone conferisce a Roberto Malini e Dario Picciau le onorificenze di Poet Laureate e Artist Laureate\". Archived from the original on December 27, 2015. Retrieved December 26, 2015.\nWoods, Tim (September 30, 2018). African pasts: Memory and history in African literatures. Manchester University Press. ISBN 978-1-5261-3079-2.\nLimb, Peter; Etherington, Norman A.; Midgley, Peter (January 1, 2010). Grappling With the Beast: Indigenous Southern African Responses to Colonialism, 1840-1930. BRILL. ISBN 978-90-04-17877-9.\nMcGiffin, Emily (July 18, 2019). Of Land, Bones, and Money: Toward a South African Ecopoetics. University of Virginia Press. ISBN 978-0-8139-4277-3.\n\"Mazisi Kunene, 76, South African Poet Laureate, Is Dead\". The New York Times. September 22, 2006. ISSN 0362-4331. Retrieved August 29, 2024.\n\"South African Literary Awards winners announced—Mongane Wally Serote is South Africa's new Poet Laureate\". The Reading List. November 7, 2018. Retrieved September 13, 2024.\n\"Keorapetse Kgositsile\". The Poetry Foundation. Retrieved September 13, 2024.\nHillelson, S. (1949). \"CLASSICAL REMINISCENCES IN POPULAR LITERATURE\". Sudan Notes and Records. Retrieved October 4, 2024.\nAkyeampong, Emmanuel Kwaku; Jr, Professor Henry Louis Gates (February 2, 2012). Dictionary of African Biography. OUP USA. ISBN 978-0-19-538207-5.\nMolony, Tom (2014). Nyerere: The Early Years. Boydell & Brewer Ltd. ISBN 978-1-84701-090-2.\nNajar, Brahim (2003). \"Poetry in the Muslim West: second to fifth/eighth to eleventh centuries\". unesdoc.unesco.org. Retrieved October 16, 2024.\nIqbal Review. Iqbal Academy. 1969.\nThe Tablet. Tablet Publishing Company. 1971.\nMsindo, Enocent (2012). Ethnicity in Zimbabwe: Transformations in Kalanga and Ndebele Societies, 1860-1990. University Rochester Press. ISBN 978-1-58046-418-5.\nThe Americana: A Universal Reference Library, Comprising the Arts and Sciences, Literature, History, Biography, Geography, Commerce, Etc., of the World. Biographies. The Author. 1923.[page needed]\nThe Concept. Raja Afsar Khan. 1985.[page needed]\nAdamec, Ludwig W. (2012). Historical Dictionary of Afghanistan. Scarecrow Press. ISBN 978-0-8108-7815-0.[page needed]\nGoi︠a︡n, Georg (1954). Two Thousand Years of the Armenian Theater: A Digest in English of Professor Georg Goyan's Recent Monumental Work in Russian : with Additional Essays in English and Armenian, by Other Contributors. Armenian National Council of America.[page needed]\nThe Armenian Review. Hairenik Association. 1975.[page needed]\nTyrrell, Maliheh S. (2000). Aesopian Literary Dimensions of Azerbaijani Literature of the Soviet Period, 1920-1990. Lexington Books. ISBN 978-0-7391-0169-8.[page needed]\nGoltz, Thomas (2015). Azerbaijan Diary: A Rogue Reporter's Adventures in an Oil-rich, War-torn, Post-Soviet Republic. Routledge. ISBN 978-1-317-47623-8.[page needed]\nẒāhir, al-Māyidī ibn (August 2023). ديوان واخبار المايدي بن ظاهر. NYU Press. ISBN 978-1-4798-2580-6.\nIkram, Sheikh Mohamad; Spear, Thomas George Percival (1955). The Cultural Heritage of Pakistan. Oxford University Press.\nKarim, Abdul (1985). Social History of the Muslims in Bengal, Down to A.D. 1538. Baitush Sharaf Islamic Research Institute.\n\"Shah Muhammad Sagir - Banglapedia\". en.banglapedia.org. Retrieved October 26, 2024.\nSen, Sukumar (1993). Islami Bangla Sahitya (in Bengali), Kolkata: Ananda Publishers, ISBN 81-7215-301-5, pp.23-33\nGhani, Nurdiyana Abd; Idris, Zubir (December 16, 2020). \"DASAR PERLEMBAGAAN SEBAGAI PENCAPAIAN SULTAN MUDA OMAR â€˜ALI SAIFUDDIEN DALAM SYAIR PERLEMBAGAAN NEGERI BRUNEI\". Jurnal Melayu Sedunia. 3 (1): 266–296. ISSN 2637-0751.\nAwang.), Mohd Jamil Al-Sufri (Pehin Orang Kaya Amar Diraja Dato Seri Utama Haji (2010). Royal Poet Al-marhum Sultan Haji Omar 'Ali Saifuddien Sa'adul Khairi Waddien. Brunei History Centre. ISBN 978-99917-34-74-3.\nJacobsen, Trudy (2008). Lost Goddesses: The Denial of Female Power in Cambodian History. NIAS Press. ISBN 978-87-7694-001-0.[page needed]\nRoces, Mina; Edwards, Louise (2010). Women's Movements in Asia: Feminisms and Transnational Activism. Routledge. ISBN 978-1-136-96799-3.[page needed]\n\"When poetry led to power\". Taiwan Today. May 1, 1979. Retrieved September 21, 2024.\nDivision, United States Adjutant-General's Office Military Information (1900). Notes on China. U.S. Government Printing Office.\nAffairs, Cyprus Committee on Turkish (1949). An Investigation Into Matters Concerning and Affecting the Turkish Community in Cyprus: Interim Report of the Committee on Turkish Affairs, 1949. U.S. Government Printing Office.\nCyprus Today. Public Information Office. 1989.\nMitchell, Colin P. (March 3, 2011). New Perspectives on Safavid Iran: Empire and Society. Taylor & Francis. ISBN 978-1-136-99194-3.\nAltekar, Anant Sadashiv (April 2002). State and Government in Ancient India. Motilal Banarsidass Publ. ISBN 978-81-208-1009-9.\nMahajan, V. D. (January 3, 2022). Ancient India. S. Chand Publishing. ISBN 978-93-5283-724-3.\nSharma, T. R. S.; Seshdri, C. K.; Gaur, June (2000). Ancient Indian Literature: Classical Sanskrit, Prakrit, and apabhramsa. Sahitya Akademi. ISBN 978-81-260-0794-3.\nSen, Sailendra Nath (1999). Ancient Indian History and Civilization. New Age International. ISBN 978-81-224-1198-0.\nKamath (2001), p45\nSastri (1955), p356\nTiwari, Shiv Kumar (2002). Tribal Roots of Hinduism. Sarup & Sons. ISBN 978-81-7625-299-7.\nHaywood 1995; Sharma 2020, p. 409; Saksena 1990, pp. 39–40.\nMansingh, Surjit (May 9, 2006). Historical Dictionary of India. Scarecrow Press. ISBN 978-0-8108-6502-0.\n\"Taleb Amoli\". iranicaonline.org. Retrieved September 23, 2024.\nSarma, Narendra Nath (1994). Paṇḍitarāja Jagannātha, the Renowned Sanskrit Poet of Medieval India. Mittal Publications. ISBN 978-81-7099-393-3.\n\"In the lanes of Zauq and Ghalib - Express India\". January 21, 2012. Archived from the original on January 21, 2012. Retrieved September 23, 2024.\nSpear, Percival (1972). \"Ghalib's Delhi\" (PDF). columbia.edu. Retrieved October 25, 2019.\nBulletin de la Société Académique Indo-Chinoise de France (in French). 1890.\nindochinoise, Société académique (1890). Bulletin de la Société académique indochinoise de France (in French).\np. 644, Land and people of Indian states and union territories : (in 36 volumes), by Shankarlal C. Bhatt, Gopal K. Bhargava, vol. 2, Kaplaz Publishers, 2006.\nNarasimhacharya (1988), pp. 64–65, p. 19\nShastri (1955), p. 358\nKamath (2001), p. 115\nJournal of South Asian Literature. Asian Studies Center, Michigan State University. 1972.\n\"Poet laureate\". Courier-Mail. November 22, 1950. Retrieved September 21, 2024.\nDr, Gadre, Anuradha (2009). Jagtik kirtiche 126 sahityik. Pune: Manorama.\nMahender, Adepu (March 23, 2017). \"Century-old library lost in time\". www.thehansindia.com. Retrieved October 26, 2024.\nInter-ocean: A Netherlands East Indian Magazine Devoted to Malaysia and Australasia (Cover Title: Inter-ocean). G. Kolff & Company. 1928.\nThe Voice of Indonesia. Broadcasting Service of the Ministry of Information of the Republic of Indonesia. 1957.\nAtma nan Jaya: majalah ilmiah Universitas Katolik Indonesia Atma Jaya (in Indonesian). Universitas Katolik Indonesia Atma Jaya. 1991.\nFlorida, Nancy K. (1995). Writing the Past, Inscribing the Future: History as Prophesy in Colonial Java. Duke University Press. ISBN 978-0-8223-1622-0.\nJr, Everett Jenkins (May 7, 2015). The Muslim Diaspora (Volume 1, 570-1500): A Comprehensive Chronology of the Spread of Islam in Asia, Africa, Europe and the Americas. McFarland. ISBN 978-1-4766-0888-4.\nSafa 1999.\nWing 2016, p. 15.\nLewisohn, Leonard (April 30, 2018). The Heritage of Sufism: Late Classical Persianate Sufism (1501-1750) v. 3. Simon and Schuster. ISBN 978-1-78607-527-7.\nGandhi, Supriya (January 7, 2020). The Emperor Who Never Was: Dara Shukoh in Mughal India. Harvard University Press. ISBN 978-0-674-24391-0.\nHillenbrand, Robert (July 5, 2017). Shahnama: The Visual Language of the Persian Book of Kings. Routledge. ISBN 978-1-351-54892-2.\nDatta, Amaresh (1987). Encyclopaedia of Indian Literature: A-Devo. Sahitya Akademi. ISBN 978-81-260-1803-1.\nAdamec, Ludwig W. (2009). The A to Z of Islam. Scarecrow Press. ISBN 978-0-8108-7160-1.\nThe Persian Manuscripts. Verlag nicht ermittelbar. 1889.\nOron, Yitzhak (1960). Middle East Record Volume 1, 1960. The Moshe Dayan Center.\n\"Writer Avigdor Hameiri Dies\". CIE. April 3, 2024. Retrieved September 12, 2024.\nGorenberg, Gershom (February 5, 2018). \"Requiem for a Storm\". The American Prospect. Retrieved September 12, 2024.\nMusicworks. Music Gallery. 2006.\n\"عر الأردن \"الوزير\" يغادر الكثبان وينعى \"الجزيرة السعيدة\": \"نعال الكاوبوي تصفع الجعفي.. والسعف والسيف\"\". August 2020.\n\"شاعر البلاط والضفّتين : وصفي التل لو عاد لصاح أعيدوني للكفن والقبر\". وكالة الهاشمية الإخبارية. Retrieved October 16, 2024.\nSchwab, Larry M. (January 1, 1991). The Illusion of a Conservative Reagan Revolution. Transaction Publishers. ISBN 978-1-4128-2583-2.\nPolitical Anthropology Yearbook. Transaction Books. 1980. ISBN 978-0-87855-371-6.\n한국 고전 문학 작가론 (in Korean). 소명 출판. 1998. ISBN 978-89-88375-02-0.\n韓國古典批評論: 신라, 조선 중기 (in Korean). 민속원. 2006. ISBN 978-89-5638-549-5.\nJang Jin-sung (2014). \"Chapter 1: Psychological Warfare\". Dear Leader: Poet, Spy, Escapee--A Look Inside North Korea. 37 Ink. ISBN 978-1476766553.\nSaleh, Sherif (May 14, 2019). \"برع في كتابة القصائد الفارسية ومدح العديد من الشيوخ ورجال الدين\". Al Nahar (Kuwaiti Newspaper).\nCroix, Jeanne Féaux de la (December 31, 2016). Iconic Places in Central Asia: The Moral Geography of Dams, Pastures and Holy Sites. transcript Verlag. ISBN 978-3-8394-3630-1.\nTIME (February 3, 1961). \"Laos: Time for Poets\". TIME. Retrieved September 13, 2024.\nFarshūkh, Muḥammad Amīn (1989). أدب الفكاهة في لبنان: دراسة وعرض (in Arabic). Dār al-Fikr al-Lubnānī.\nAnthropologica. M. Nijhoff. 2005.\nAGENCY. \"Malaysia's first female poet laureate started writing because she was not encouraged to speak as a child\". The Star. Retrieved October 18, 2024.\nBosworth, C. Edmund (October 25, 2001). A Century of British Orientalists, 1902-2001. OUP/British Academy. ISBN 978-0-19-726243-6.\nField, Garrett (November 2022). \"Poetry for linguistic description: The Maldives inside and outside the Arabic cosmopolis in 1890\". Modern Asian Studies. 56 (6): 1951–1982. doi:10.1017/S0026749X21000603. ISSN 0026-749X.\nStimac, Tony (May 25, 2023). An Accidental Journey: A Memoir of a Life in the Theater. Archway Publishing. ISBN 978-1-6657-4444-7.\nInner Asia. White Horse Press for the Mongolia and Inner Asia Studies Unit at the University of Cambridge. 1999.\nKhin Maung Nyuntt (1999). An Outline History of Myanmar Literature: Pagan Period to Kon-baung Period. Yangon. p. 71. ASIN B00398UY4C.\nThaw Kaung (2011). \"The Myanmar Poetic Account of Ayutthaya Vanquished: Notes on Its Rediscovery and Significance\" (PDF). p. 27.\n\"Toungoo Period Writers\" (PDF). Burma Press. Vol. 1, no. 8. November 1987. p. 11.\nSmyth, David (October 8, 2013). The Canon in Southeast Asian Literature: Literatures of Burma, Cambodia, Indonesia, Laos, Malaysia, the Philippines, Thailand and Vietnam. Routledge. ISBN 978-1-136-81612-3.\n\"Letwe Nawrahta (1723-1791), Recorder of Myanmar History\" (PDF). UCL Myanmar.\nHis specific ministerial title was Away-Yauk-Min, Burmese: အဝေးရောက်မင်း [əwéi jaʊʔ mí̃] (SEAlang Library Burmese Dictionary)\nsū, Thī lā Cacʻ (1998). မြန်မာကဗျာဝေဖန်ရေးစာပေ: An Appreciation (in Burmese). Moe Min Sarpay.\nNepal To-day. 1965.\nJournal of the Asiatic Society of Bombay. Asiatic Society of Bombay. 1987.\nRajbhandari, Keshab R.; Bhattarai, Sushila (2001). Beautiful Orchids of Nepal. Keshab R. Rajbhandari. ISBN 978-99933-51-83-2.\nVine, Peter (1995). Oman in History. Ministry of Information. ISBN 978-1-898162-11-7.\nClaus, Peter; Diamond, Sarah; Mills, Margaret (October 28, 2020). South Asian Folklore: An Encyclopedia. Routledge. ISBN 978-1-000-10122-5.\nTimes of India Illustrated Weekly. Published for the proprietors, Bennett, Coleman & Company, Limited, at the Times of India Press. 1983.\n\"111st [sic?] Anniversary of Dr. José P. Rizal's martyrdom\". Manila Bulletin. December 1, 2008. Archived from the original on December 1, 2008. Retrieved October 23, 2024.\n\"A poet on a motorcycle\". Lifestyle.INQ. October 8, 2016. Retrieved September 12, 2024.\nBritish Documents on Foreign Affairs--reports and Papers from the Foreign Office Confidential Print: From the First to the Second World War. Series B, Turkey, Iran, and the Middle East, 1918-1939. University Publications of America. 1985. ISBN 978-0-89093-603-0.\nStatistical Pocket Book of the Republic of Sri Lanka (Ceylon). Department of Census and Statistics. 1974.\nDarke, Diana (2010). Syria. Bradt Travel Guides. ISBN 978-1-84162-314-6.\nMirza, Nasseh Ahmad (October 24, 2018). Syrian Ismailism: The Ever Living Line of the Imamate, A.D. 1100--1260. Routledge. ISBN 978-1-136-79568-8.\nDaftary, Farhad (March 23, 2005). Ismaili Literature: A Bibliography of Sources and Studies. Bloomsbury Publishing. ISBN 978-0-85773-994-0.\n\"Taiwan's Poet Laureate\". National Museum of History (Taiwan).\n盧國才, 張貼者：. \"第687篇：《詩林》\". Retrieved October 23, 2024.\n\"United Poets Laureate International | UIA Yearbook Profile | Union of International Associations\". uia.org. Retrieved October 23, 2024.\nExpress News Service (January 16, 2014). \"Taiwan-origin Tamil Scholar Gets Thiruvalluvar Award\". The New Indian Express. Express Publications. Archived from the original on October 20, 2014. Retrieved August 19, 2016.\nHiro, Dilip (November 1, 2011). Inside Central Asia: A Political and Cultural History of Uzbekistan, Turkmenistan, Kazakhstan, Kyrgyzstan, Tajikistan, Turkey, and Iran. Abrams. ISBN 978-1-59020-378-1.\nTaus-Bolstad, Stacy (August 1, 2003). Thailand in Pictures. Twenty-First Century Books. ISBN 978-0-8225-0939-4.\nPeleggi, Maurizio (May 30, 2007). Thailand: The Worldly Kingdom. Reaktion Books. ISBN 978-1-86189-314-7.\nChalisova 2000.\n\"TRUST THROUGH UNDERSTANDING\". www.turkmenistaninfo.ru. Retrieved October 3, 2024.\nSuwaidi (PVT), Dr Hamed Bin Mohamed Khalifa Al (August 12, 2020). \"Honouring the Late Poet Laureate of the UAE\". Medium. Retrieved September 26, 2024.\nVámbéry, Ármin (1873). History of Bokhara: From the Earliest Period Down to the Present. H.S. King.\nKazakh & Kirghiz Studies Bulletin: Newsletter of the Kazakh-Kirghiz Studies Group, University of Washington. Kazakh-Kirghiz Studies Group, University of Washington. 1993.\nAACAR Bulletin of the Association for the Advancement of Central Asian Research. The Association. 1989.\nGobron, Gabriel (March 1, 2008). History and Philosophy of Caodaism. Wildside Press LLC. ISBN 978-1-4344-6284-8.\nNguyen-vo, Thu-huong (June 11, 2024). Almost Futures: Sovereignty and Refuge at World's End. Univ of California Press. ISBN 978-0-520-39446-9.\nBarber, Karin; Jeyifo, Biodun; Julien, Eileen; Buzi, Paola; Bausi, Alessandro; Idrissi Alami, Ahmed; Holmberg, Bo; El Koulali, Salima; de Moraes-Farias, Paulo F. (June 6, 2022), Damrosch, David; Lindberg-Wada, Gunilla (eds.), \"Africa\", Literature (1 ed.), Wiley, pp. 542–588, doi:10.1002/9781119775737.ch18, ISBN 978-0-470-67190-0, retrieved October 4, 2024\nMcLaughlin, Daniel (2007). Yemen. Bradt Travel Guides. ISBN 978-1-84162-212-5.\n\"\"Weared with the sun and covered with the moon\" Rudolf Marku brings the Anthology of Albanian poetry\". politiko.al. Retrieved September 12, 2024.\n\"Luljeta Lleshanaku is declared 'Poet Laureate': Why has it been difficult to face the Albanian reader\". Vox News. Retrieved September 16, 2024.\nHarding, Bertita (1962). Concerto: The Story of Clara Schumann. G. G. Harrap.[page needed]\nHacohen, Mordecai (2008). Homeland: From Clandestine Immigration to Israeli Independence. Beaufort Books. ISBN 978-0-8253-0590-0.[page needed]\nHacohen, Malachi Haim (2019). Jacob & Esau. doi:10.1017/9781108226813. ISBN 978-1-108-22681-3.[page needed]\n\"Lost Royal Poem Found\". La Habra Star. April 22, 1964.\nHarlig, Jeffrey; Pléh, Csaba (1995). When East Met West: Sociolinguistics in the Former Socialist Bloc. Walter de Gruyter. ISBN 978-3-11-014585-4.[page needed]\nSoviet Union: Political Affairs (Report). United States Joint Publications Research Service. July 7, 1988. DTIC ADA350915.[page needed]\nWorld Wide. J.R. Dougall, F.E. Dougall. 1915.\nThe Nation. Nation Publishing Company Limited. October 1914.\n\"Els Moors: the new Belgian Poet Laureate | Flanders literature\". www.flandersliterature.be.\n\"Meet Belgium's first Poet Laureate\". Poetry International Archives. Archived from the original on February 7, 2020. Retrieved February 6, 2020.Dutch-language poet Charles Ducal\n\"BERSONG EURO-PINOY A FESTIVAL OF EUROPEAN AND FILIPINO POETRY AIRS LIVE ON 27 MAY | EEAS Website\". www.eeas.europa.eu.\nDojcinovic, Predrag (March 1, 2013). Propaganda, War Crimes Trials and International Law: From Speakers' Corner to War Crimes. Routledge. ISBN 978-1-136-58840-2.\nMerrill, Christopher (October 23, 2001). Only the Nails Remain: Scenes from the Balkan Wars. Rowman & Littlefield. ISBN 978-0-7425-1686-1.\nHarvard Slavic Studies. Harvard University Press. 1953.\nThe South Slav Journal. Dositey Obradovich Circle. 1986.\nFine, John V. A. (February 5, 2010). When Ethnicity Did Not Matter in the Balkans: A Study of Identity in Pre-Nationalist Croatia, Dalmatia, and Slavonia in the Medieval and Early-Modern Periods. University of Michigan Press. ISBN 978-0-472-02560-2.\nVuksić, Stojan (1987). Ipsilonski dnevnik (in Serbian). S. Vuksić.\nDvornik, Francis (1962). The Slavs in European History and Civilization. Rutgers University Press. ISBN 978-0-8135-0799-6.\nStorchová, Lucie, ed. (2020). Czech Lands, Part 1. doi:10.1515/9783110650181. ISBN 978-3-11-065018-1.[page needed]\nHaase, Wolfgang; Reinhold, Meyer (1994). The Classical Tradition and the Americas: European images of the Americas and the classical tradition. Walter de Gruyter. ISBN 978-3-11-011572-7.[page needed]\nFlood, John (September 8, 2011). Poets Laureate in the Holy Roman Empire: A Bio-bibliographical Handbook. Walter de Gruyter. ISBN 978-3-11-091274-6.\n\"A Danish Star\". Sacramento Daily Union. July 31, 1897. Retrieved September 20, 2024.\nSalumets, Thomas (2014). Unforced Flourishing: Understanding Jaan Kaplinski. McGill-Queen's Press - MQUP. ISBN 978-0-7735-9217-9.[page needed]\nGammerdinger, Harry (1980). Folklore on Two Continents: Essays in Honor of Linda Dégh. Trickster Press. ISBN 978-0-915305-01-8.\nLatin for the New Millennium: Level 3: Student text. Bolchazy-Carducci Publishers. ISBN 978-1-61041-069-4.\nRosenberg, Pierre; N.Y.), Metropolitan Museum of Art (New York (1982). France in the Golden Age: Seventeenth-century French Paintings in American Collections. Metropolitan Museum of Art. ISBN 978-0-87099-295-7.\nHumanities, National Endowment for the (September 23, 1903). \"The Pacific commercial advertiser. [volume] (Honolulu, Hawaiian Islands) 1885-1921, September 23, 1903, Image 6\". p. 6. ISSN 2375-3137. Retrieved September 24, 2024.\nHumanities, National Endowment for the (April 25, 1907). \"The Carlisle independent. (Carlisle, Ark.) 1905-current, April 25, 1907, Image 2\". Retrieved September 24, 2024.\nHumanities, National Endowment for the (June 19, 1921). \"The Washington herald. [volume] (Washington, D.C.) 1906-1939, June 19, 1921, Image 36\". ISSN 1941-0662. Retrieved September 24, 2024.\nChisholm, Hugh, ed. (1911). \"Rist, Johann von\" . Encyclopædia Britannica. Vol. 23 (11th ed.). Cambridge University Press. p. 366.\nRogers, Charles (1869). TRANSACTIONS OF THE ROYAL HISTORICAL SOCIETY. VOL. VIII. Royal Historical Society (Great Britain).\nWest, Hugh Allen (1979). From Tahiti to the Terror: George Forster, the Literature of Travel, and Social Thought in the Late Eighteenth Century. Stanford University.\n\"German President-elect has an Indian 'intellectual connection'\". Business Standard India. March 15, 2017 – via Business Standard.\nService, Tribune News. \"Punjab-born German poet laureate Rajvinder Singh dies\". Tribuneindia News Service.\n\"Punjab-born German writer Rajvinder Singh passes away in Berlin\". Hindustan Times. December 18, 2021.\nPisharoty, Sangeeta Barooah (September 1, 2012). \"'East and West meet in me'\". The Hindu – via www.thehindu.com.\nPioneer, The. \"Indian-origin poet Rajvinder Singh excels in German oeuvre\". The Pioneer.\n\"Acclaimed community theatre artiste Channi succumbs to virus\". The Statesman. May 22, 2021.\nWarner, Charles Dudley; Cunliffe, John William; Thorndike, Ashley Horace; Ayres, Harry Morgan; Keller, Helen Rex; Lomer, Gerhard Richard (1917). The Warner Library: The world's best literature. Warner Library Company.\nSacks, David; Murray, Oswyn; Brody, Lisa R. (May 14, 2014). Encyclopedia of the Ancient Greek World. Infobase Publishing. ISBN 978-1-4381-1020-2.\nJournal of the Hellenic Diaspora. Pella Publishing Company. 1978.\n\"Writer Seeking Funds to Build Up Big Navy\". Sacramento Daily Union. September 13, 1909. Retrieved September 19, 2024.\nPsoni, Anastasia (December 19, 2018). The Image of the Feminine in the Poetry of W.B. Yeats and Angelos Sikelianos. Cambridge Scholars Publishing. ISBN 978-1-5275-2380-7.\nModern Greek Studies Yearbook. University of Minnesota. 1992.\nEtudes Slaves Et Est-européennes: Slavic and East-European Studies (in French). Presses de l'Université Laval. 1961.\n\"Zsófia Balla\". Jewish Women's Archive. June 23, 2021. Retrieved September 16, 2024.\nBédé, Jean Albert; Edgerton, William Benbow (1980). Columbia Dictionary of Modern European Literature. Columbia University Press. ISBN 978-0-231-03717-4.\nMarsh, James H. (1999). The Canadian Encyclopedia. The Canadian Encyclopedia. ISBN 978-0-7710-2099-5.\nHugh Montgomery-Massingberd, Burke's Irish Family Records (1976) p. 634 Archived October 23, 2021, at the Wayback Machine.\n\"Poet Laureate: Rachael Hegarty | Dublin 1 | Poetry Town | Poetry Ireland\". www.poetryireland.ie. Retrieved October 26, 2024.\nCooper, Thompson (1879). Men of the Time: A Dictionary of Contemporaries, Containing Biographical Notices of Eminent Characters of Both Sexes. G. Routledge.\nLindon 2005, n.p.\nEgmont Lee, Sixtus IV and men of letters (Ed. di Storia e Letteratura, 1970), page 88.\nLatvijas Kara muzeja gadagrāmata (in Latvian). Latvijas Kara Muzejs. 2001. ISBN 978-9984-643-40-3.\nNeimanis, George (February 19, 1997). The Collapse of the Soviet Empire: A View from Riga. Bloomsbury Publishing USA. ISBN 978-0-313-02437-5.\nDart, John (January 12, 1998). \"Day for Knights\". Los Angeles Times. Retrieved September 16, 2024.\n\"2020 kovas. Prof. dr. Salman Akhtar prisimena Vilnių | Lietuvos psichoanalizės draugija\". lpad.lt (in Lithuanian). April 1, 2020. Retrieved September 16, 2024.\nWarner, J. Christopher (March 9, 2016). The Making and Marketing of Tottel's Miscellany, 1557: Songs and Sonnets in the Summer of the Martyrs' Fires. Routledge. ISBN 978-1-317-02497-2.\n\"The inauguration of Malta's first Poet Laureate | Kunsill Nazzjonali Tal-Ktieb\". July 12, 2023. Retrieved September 12, 2024.\nIonescu, Dan (2002). From SSMR to the Republic of Moldova ± Pmr. Museum. ISBN 978-9975-906-70-8.\nSouthern Lumberman ... J.H. Baird Publishing Company. 1920.\n\"Hester Knibbe (poet) - Netherlands - Poetry International\". March 4, 2016. Archived from the original on March 4, 2016. Retrieved October 26, 2024.\nKulturdepartementet (June 17, 2011). \"Dag Solstad tildelt statens æreslønn\". Regjeringen.no (in Norwegian Bokmål). Retrieved September 21, 2024.\nJakub Zdzisław Lichański, wybór i wstęp (1986). Maciej Kazimierz Sarbiewski poezje wybrane. Warszawa: Ludowa Spółdzielnia Wydawnicza. p. 104. ISBN 83-205-3961-7.\n\"Gil Vicente summary | Britannica\". www.britannica.com. Retrieved September 17, 2024.\nBell, Aubrey Fitz Gerald (1922). Portuguese Literature. Clarendon Press. ISBN 978-0-7426-4418-2.\nJayne, K. G. (May 3, 2023). Vasco da Gama and his Successors, 1460–1580. Taylor & Francis. ISBN 978-1-000-85804-4.\nVasile Alecsandri. Ardent Media.\nThe New Pioneer. Cultural Association for Americans of Roumanian Descent. 1945.\nLivezeanu, Irina (August 6, 2018). Cultural Politics in Greater Romania: Regionalism, Nation Building, and Ethnic Struggle, 1918–1930. Cornell University Press. ISBN 978-1-5017-2771-9.\nLehrer, Milton G. (1986). Transylvania, History and Reality. Bartleby Press. ISBN 978-0-910155-04-5.\nMagill, Frank Northen (1984). Critical Survey of Poetry: Foreign Language Series. Salem Press. ISBN 978-0-89356-350-9.\nBuckler, Julie; Johnson, Emily D. (August 31, 2013). Rites of Place: Public Commemoration in Russia and Eastern Europe. Northwestern University Press. ISBN 978-0-8101-6659-2.\nBjörkegren, Hans (1972). Aleksandr Solzhenitsyn: A Biography. Third Press. ISBN 978-0-89388-050-7.\nKlein, Leonard S.; Serafin, Steven; Glanze, Walter D. (1981). Encyclopedia of World Literature in the 20th Century. Ungar. ISBN 978-0-8044-3135-4.\nHuddleston, Sisley (1928). Paris Salons, Cafés, Studios. J.B. Lippincott.\nJolas, Eugène (2009). Eugene Jolas: Critical Writings, 1924-1951. Northwestern University Press. ISBN 978-0-8101-2581-0.\nMarko Živković (2011). Serbian Dreambook: National Imaginary in the Time of Milošević. Indiana University Press. p. 32. ISBN 978-0-253-22306-7.\nNicholson Baker (October 9, 2014). The Paul Chowder Chronicles: The Anthologist and Traveling Sprinkler, Two Novels. Penguin Publishing Group. p. 263. ISBN 978-0-698-18173-1.\nLaurence Mitchell (2013). Serbia. Bradt Travel Guides. p. 49. ISBN 978-1-84162-463-1.\nCharles A. Ward; Shashko, Philip; Donald E. Pienkos (1980). Studies in Ethnicity: The East European Experience in America. Boulder : East European Monographs; New York. p. 114. ISBN 978-0-914710-67-7.\nAlmanac. The Society. 1991.\nSouvenir Program ... 1946.\nWilson, Thomas M. (November 30, 2023). Europe: An Encyclopedia of Culture and Society [2 volumes]. Bloomsbury Publishing USA. ISBN 979-8-216-17140-9.\nRosicrucian Digest. Supreme Council of the Rosicrucian Order. 1965.\nمحمد, ابن دراج، أحمد بن (1969). ديوان ابن دراج القسطلي (in Arabic). المكتب الاسلامي،.\nHumanities, National Endowment for the (March 9, 1869). \"The New Orleans crescent. [volume] (New Orleans, La.) 1866-1869, March 09, 1869, Morning, Image 2\". p. 2. ISSN 2165-9176. Retrieved September 24, 2024.\nPrice, Frank Webster (1950). Collier's Encyclopedia: With Bibliography and Index. Collier.\nThe National Cyclopaedia of American Biography: Being the History of United States as Illustrated in the Lives of the Founders, Builders, and Defenders of the Republic, and of the Men and Women who are Doing the Work and Moulding the Thought of the Present Time. J. T. White. 1900.\nThe Nation. J.H. Richards. 1948.\nHackensmith, Charles William (1966). History of Physical Education. Harper & Row. ISBN 978-0-06-042572-2.\nWeber, Olga S. (1970). Literary and Library Prizes. Bowker. ISBN 978-0-8352-0399-9.\nSchelbert, Leo (May 21, 2014). Historical Dictionary of Switzerland. Rowman & Littlefield. ISBN 978-1-4422-3352-2.\nMontalk, Stephanie De (2001). Unquiet World: The Life of Count Geoffrey Potocki de Montalk. Victoria University Press. ISBN 978-0-86473-414-3.\nThe Ukrainian Bulletin. Ukrainian Congress Committee of America. 1948.\nDialogue. Dialogue Foundation. 2006.\nNotes and Queries. Oxford University Press. 1876.\nFlannery, Mary C. (2016), \"The English Laureate in Time: John Skelton's Garland of Laurel\", Medieval into Renaissance: Essays for Helen Cooper, Boydell & Brewer, pp. 107–122, ISBN 978-1-78204-627-1, retrieved June 20, 2025\n\"Children's Laureate\". Book Trust. Retrieved May 4, 2019.\nMacDonald, John (1964). MacKenzie, Annie (ed.). Òrain Iain Luim: Songs of John MacDonald, Bard of Keppoch. The Scottish Gaelic Texts Society. pp. xxxviii.\n\"Liz Lochhead confirmed as new Scots Makar\". BBC News. January 19, 2011.\n\"Jackie Kay announced as new Scots Makar\". BBC News. March 15, 2016.\n\"Kathleen Jamie\". Scottish Poetry Library. Retrieved May 9, 2022.\nLivingston, Eve (December 3, 2024). \"'Scotland has always been multilingual': new Scottish makar Peter Mackay\". The Guardian. ISSN 0261-3077. Retrieved December 5, 2024.\n\"Jim Carruth\". Poetry Archive. Retrieved October 26, 2024.\n\"Previous Bardd Plant Cymru\". Literature Wales. Retrieved December 9, 2023.\n\"Children's Laureate Wales & Bardd Plant Cymru\". Libraries Wales. Retrieved December 9, 2023.\n\"Dr. Richard Georges Is Territory's First Poet Laureate | Government of the Virgin Islands\". bvi.gov.vg. Retrieved August 29, 2024.\nGallego, Shanda (May 28, 2024). \"Poets move to the beats of freedom\". Cayman Compass. Retrieved September 13, 2024.\nWigglesworth, Angela (1992). Falkland People. P. Owen. ISBN 978-0-7206-0850-2.\n\"Zoe Cannell named 6th Manx Bard\". Manx Radio. Retrieved September 13, 2024.\n\"Meeting the new Manx Bard\". www.biosphere.im. Retrieved September 13, 2024.\n\"New Manx bard to add to 'rich tapestry' of island's culture\". www.bbc.com. Retrieved September 13, 2024.\n\"My Biosphere Boakesey Closs\". www.biosphere.im. Retrieved October 10, 2024.\n\"John Freddy Montoya werd benoemd tot Dichter des Vaderlands\". Overheid van Aruba (in Dutch). March 19, 2025. Retrieved July 11, 2025.\nJiménez, Doña Luz (1979). De Porfirio Díaz a Zapata: memoria náhuatl de Milpa Alta. UNAM, Instituto de Investigaciones Históricas.\nShooman, Joe (July 3, 2018). \"'I'd love to see poetry explode'\". Zing magazine. Retrieved September 28, 2020.\nSealy, John (March 14, 2018). \"Esther Phillips is Barbados' first ever poet laureate\". Nation News. Retrieved September 28, 2020.\n\"THE PARLIAMENTARY POET LAUREATE\". Parliament of Canada. Retrieved August 8, 2022.\n\"Winnipeg Poet Laureate | The Winnipeg Arts Council\". winnipegarts.ca.\n\"Poet Laureates / Poètes lauréats | Poésie Moncton Poetry\". poesiemonctonpoetry.\nTower, Katie. \"Shoshanna Wingate appointed Sackville's new Poet Laureate | SaltWire\". www.saltwire.com.\n\"Poet Laureate Laura K. Watson\". Town of Sackville.\n\"Poet Laureate | City Of St. John's\". www.stjohns.ca.\n\"Rita Joe\". ATLANTIC CANADIAN POETS' ARCHIVE.\n\"Rita Joe | The Canadian Encyclopedia\". www.thecanadianencyclopedia.ca.\nToolkit (August 18, 2016). \"John Smith: Poet Laureate 2002-2004 Experience\". www.princeedwardisland.ca.\nCBC.ca Arts - P.E.I. appoints poet laureate\n\"Poet Laureate\". Government of Prince Edward Island. April 11, 2016. Retrieved August 8, 2022.\n\"Canada's Poets Laureate\". League of Canadian Poets. Retrieved August 8, 2022.\n\"Yukon Poet Laureate\". Yukon Poet Laureate. Retrieved August 8, 2022.\n\"Commissioner introduces first Story Laureate of Yukon\". yukon.ca. October 16, 2020. Retrieved October 22, 2022.\nLibrary of Congress Information Bulletin. The Library. 1984.\nAlbin, María C.; Corbin, Megan; Marrero-Fente, Raul (Spring 2017). \"A Transnational Figure: Gertrudis Gómez de Avellaneda and the American Press\". Hispanic Issues on Line.\nAddison, Ennis Phillip (2021). From Harlem to Havana and Back Again: Ruin, the Performative Politics of Survival, and the Ambivalent, State-Sponsored Detective in Chester Himes' Harlem Domestic and Leonardo Padura's Cuatro Estaciones (Thesis). ProQuest 2634857050.[page needed]\nVersón, Salvador Díaz (1980). One Man, One Battle. World Wide Publishing Company. OCLC 7173461.[page needed]\nAteneo de El Salvador: órgano del Centro del mismo nombre (in Spanish). El Ateneo. 1921.\nUlloa, Juan (1957). Ventanas al azul (in Spanish). Editorial Ahora.\nStewart, Iain (February 16, 2009). The Rough Guide to Guatemala. Penguin. ISBN 978-1-84836-808-8.\nJones, Willis Knapp (July 29, 2014). Behind Spanish American Footlights. University of Texas Press. ISBN 978-1-4773-0015-2.\nCLA Journal. College Language Association. 1984.\nHerdeck, Donald E.; Lubin, Maurice Alcibiade; Laniak-Herdeck, Margaret (1979). Caribbean Writers: A Bio-bibliographical-critical Encyclopedia. Three Continents Press. ISBN 978-0-914478-74-4.\nWehner, Lauren; Mcgaffey, Leta; Spilling, Michael (December 15, 2018). Honduras. Cavendish Square Publishing, LLC. ISBN 978-1-5026-4102-1.\nRevista de derecho, historia y letras (in Spanish). J. Peuser. 1922.\n\"Former Poets Laureate\". National Library of Jamaica. Retrieved August 7, 2022.\n\"poet laureate of Jamaica\". National Library of Jamaica. Retrieved August 7, 2022.\n\"Ghanaian Author Kwame Dawes Honored as the Poet Laureate of Jamaica\". brittlepaper.com. Retrieved August 29, 2024.\nChronicle. West Indian Committee. 1939.\nThompson, Charles Henry (1942). The Journal of Negro Education. Bureau of Educational Research.\nEdwards, Chris (November 10, 2015). Connecting the Dots in World History, A Teacher's Literacy Based Curriculum: From the Mongol Empire to the Reformation. Rowman & Littlefield. ISBN 978-1-4758-2319-6.\nDay, Arthur Grove (January 1, 1964). The Sky Clears: Poetry of the American Indians. U of Nebraska Press. ISBN 978-0-8032-5047-5.\nCentral America and Mexico. James C. Parish, Jr. 1953.\nSports Afield. Hearst Corporation. 1898.\nThe Independent. S. W. Benedict. 1909.\nKroiz, Lauren (September 6, 2012). Creative Composites: Modernism, Race, and the Stieglitz Circle. Univ of California Press. ISBN 978-0-520-27249-1.\nThe Christian Advocate. T. Carlton & J. Porter. 1901.\n\"Fernando Fernández presenta un retrato nítido y completo de la obra de López Velarde\". www.proceso.com.mx (in Spanish). Retrieved October 10, 2024.\nTenorio-Trillo, Mauricio (February 24, 2015). I Speak of the City: Mexico City at the Turn of the Twentieth Century. University of Chicago Press. ISBN 978-0-226-79273-6.\nPlancarte, Gabriel Méndez (1943). Ábside (in Spanish).\nWelch, William (February 23, 2019). \"Gerardo de Jesús Monroy es el poeta laureado\". Retrieved October 11, 2024 – via PressReader.\nIntelectual, Honduras Oficina de Cooperación (1949). La sucesión presidencial en Honduras (in Spanish). Talleres Tipo-Litográficos \"Aristón\".\nRodríguez, Rubén Leyton (1953). Belice es tierra de Guatemala (in Spanish). Ediciones R. Leyton Prado.\nKunitz, Stanley; Loizeaux, Marie Duvernoy (1943). Wilson Library Bulletin. H.W. Wilson Company.\n\"Derek Walcott, St. Lucian Poet and Nobel Laureate, Wrote Frequently About USVI | St. Thomas Source\". stthomassource.com. Retrieved August 29, 2024.\nWroe, Nicholas (September 1, 2000). \"The laureate of St Lucia\". The Guardian. ISSN 0261-3077. Retrieved August 29, 2024.\n\"Poet Laureate of Trinidad and Tobago\". Circle of Poets TT. Retrieved September 13, 2024.\n\"You never know who's listening\". Trinidad and Tobago Newsday. March 18, 2018. Retrieved September 13, 2024.\nEmrit, Ronald C., \"Pearl Eintou Springer\", Best of Trinidad.\n\"POETRY: THE NAMES\". pbs.org. September 6, 2002. Archived from the original on October 2, 2002. Retrieved December 28, 2019.\nHawgood, Alex (November 3, 2017). \"Meet Amanda Gorman, America's First Youth Poet Laureate (Published 2017)\". The New York Times. ISSN 0362-4331. Retrieved January 20, 2021.\n\"State Poets Laureate A Resource Guide\". Library of Congress. Retrieved February 14, 2025.\nGosetti, Valentina (January 30, 2023). \"Australia is to have a poet laureate – how will the first appointment define us as a nation?'\". The Conversation. Retrieved April 1, 2024.\n\"Australian poet laureate\". The Argus (Melbourne). Victoria, Australia. May 3, 1945. p. 5. Retrieved June 21, 2020 – via Trove.\nNoonan, Kathleen (October 12, 2009). \"Australia needs a poet laureate\". news.com.au. Retrieved June 21, 2020.\nSchwartz, Steven (February 28, 2018). \"Australia needs a Poet Laureate\". The Centre for Independent Studies. Retrieved June 21, 2020.\n\"Brunton Stephens. Australian Poet Laureate\". The Week. Queensland, Australia. July 6, 1894. p. 10. Retrieved June 21, 2020 – via Trove.\n\"Gallery of Australian authors. 'Banjo' Paterson, Poet Laureate\". Queensland Times. Queensland, Australia. April 15, 1933. p. 10 (Daily.). Retrieved June 21, 2020 – via Trove.\nMcNab, Heather (June 12, 2019). \"Australia's unofficial poet laureate Les Murray farewelled\". Australian Financial Review. Retrieved June 21, 2020.\nLal, Brij V. (October 15, 2019). Levelling Wind: Remembering Fiji. ANU Press. ISBN 978-1-76046-267-3.\nIndian Diaspora: Socio-Cultural and Religious Worlds. BRILL. February 4, 2015. ISBN 978-90-04-28806-5.\n\"What In The World ...? -- Verse Case: A Little Doggerel Goes A Long Way In Kiribati | The Seattle Times\". archive.seattletimes.com. Retrieved September 13, 2024.\n\"Auckland professor named NZ Poet Laureate\". The New Zealand Herald. December 5, 2007. Archived from the original on February 23, 2013. Retrieved September 12, 2011.\n\"New Zealand Poet Laureate\". Archived from the original on January 6, 2012. Retrieved January 5, 2012.\n\"Poet Laureate Award\". Retrieved March 14, 2020.\nChumko, André (August 25, 2022). \"Chris Tse is New Zealand's next poet laureate\". Stuff. Retrieved April 25, 2023.\n\"Vol. 44, No. 9 ( Sep. 1, 1973)\". Trove. Retrieved September 26, 2024.\nBeier, Ulli (2005). Decolonising the Mind: The Impact of the University of Culture and Identity in Papua New Guinea, 1971-1974. Pandanus. ISBN 978-1-74076-137-6.\nPacific Islands Monthly. Pacific Publications. 1968.\nSuzzallo, Henry; Beardsley, William Waite (1932). The National Encyclopedia. P.F. Collier & Son Company.[page needed]\nSmith, Verity (January 14, 2014). Concise Encyclopedia of Latin American Literature. Routledge. ISBN 978-1-135-96033-9.\nHigginson Journal. Higginson Press. 1974.[page needed]\nHolston, James (September 8, 1989). The Modernist City: An Anthropological Critique of Brasilia. University of Chicago Press. ISBN 978-0-226-34979-4.\nCamayd-Freixas, Erik (March 14, 2013). Orientalism and Identity in Latin America: Fashioning Self and Other from the (Post)Colonial Margin. University of Arizona Press. ISBN 978-0-8165-2953-7.\n\"Galvarino Merino Duarte poeta laureado. [artículo]\". BND: Archivo de referencias críticas. Retrieved October 1, 2024.\nCorcoran, James Andrew; Ryan, Patrick John; Prendergast, Edmond Francis (1920). The American Catholic Quarterly Review. Hardy and Mahony.\nWarner, Charles Dudley (June 1, 2008). A Library of the World's Best Literature - Ancient and Modern - Vol.XXII (Forty-Five Volumes); Kingsley-Le Sage. Cosimo, Inc. ISBN 978-1-60520-209-9.\nLauderbaugh, George M. (2019). Historical Dictionary of Ecuador. Rowman & Littlefield. ISBN 978-1-5381-0246-6.[page needed]\nPoesía ecuatoriana (in Spanish). Editorial \"Fray Jodoco Ricke\". 1969.\nInter-America. Doubleday, Page. 1919.\nGuyana Review. Cosmopolitan Communications Corporation. 1995.\nSome Spanish-American Poets (in Spanish). University of Pennsylvania Press. November 11, 2016. ISBN 978-1-5128-0052-4.\nVitis, Michael Angelo De (1910). Parnaso paraguayo: selectas composiciones poéticas, coleccionadas (in Spanish). Maucci.\nBros, Maggs (1927). Bibliotheca Americana Et Philippina. Maggs Bros.\nBros, Maggs (1926). Catalogue. Maggs Bros. Limited.\n\"Poet Liberated\". Sacramento Daily Union. October 7, 1920. Retrieved September 19, 2024.\nPayne, Anthony; Sutton, Paul (February 4, 2014). Size and Survival: The Politics of Security in the Caribbean and the Pacific. Routledge. ISBN 978-1-135-23681-6.\nStudies, Southeastern Council on Latin American (1993). S.E.C.O.L.A.S. Kennesaw Junior College.\nPoet Lore. Writer's Center. 1948."
    },
    {
      "type": "paragraph",
      "text": "    Spence, James Mudie (1878). The Land of Bolivar: Or, War, Peace, and Adventure in the Republic of Venezuela. AMS Press. ISBN 978-0-404-06177-7."
    },
    {
      "type": "paragraph",
      "text": "External links"
    },
    {
      "type": "paragraph",
      "text": "    Poet Laureate of Canada Archived October 7, 2008, at the Wayback Machine\n    Map of Canadian Poets Laureate\n    Poets Laureate of South Africa\n    List of U.S. Poets Laureate at the Library of Congress\n    Poets Laureate for the Commonwealth (state) of VIRGINIA, United States of America via The Poetry Society of Virginia\n    Poet Laureate of Winona, Minnesota (2009 -)"
    },
    {
      "type": "paragraph",
      "text": "Categories:"
    },
    {
      "type": "paragraph",
      "text": "    Poets laureatePoets"
    },
    {
      "type": "paragraph",
      "text": "    This page was last edited on 11 July 2025, at 22:04 (UTC).\n    Text is available under the Creative Commons Attribution-ShareAlike 4.0 License; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization."
    },
    {
      "type": "paragraph",
      "text": "    Privacy policy\n    About Wikipedia\n    Disclaimers\n    Contact Wikipedia\n    Code of Conduct\n    Developers\n    Statistics\n    Cookie statement\n    Mobile view"
    },
    {
      "type": "paragraph",
      "text": "    Wikimedia Foundation\n    Powered by MediaWiki"
    },
    {
      "type": "paragraph",
      "text": ""
    }
  ],
  "date": "2025-08-02T11:57:01.599Z"
}
